{"version":"1","records":[{"hierarchy":{"lvl1":"Grafos de conocimiento"},"type":"lvl1","url":"/","position":0},{"hierarchy":{"lvl1":"Grafos de conocimiento"},"content":"","type":"content","url":"/","position":1},{"hierarchy":{"lvl1":"Grafos de conocimiento","lvl2":"Contexto"},"type":"lvl2","url":"/#contexto","position":2},{"hierarchy":{"lvl1":"Grafos de conocimiento","lvl2":"Contexto"},"content":"La página de Wikipedia sobre \n\nArtificial Intelligence) incluye a la derecha un menú jerarquizado de temas. Si se despliega la sección Approaches se muestran varias líneas históricas de diseño de sistemas inteligentes, que se están considerando conjuntamente en el diseño de sistemas híbridos. Resumidamente, se contemplaban dos grandes estrategias de diseño que se presentan en el siguiente desplegable.\n\nSistemas entrenables y sistemas basados en conocimiento\n\nSistemas conexionistas entrenables\n\nEste el caso de los sistemas que aprenden mediante \n\nMachine Learning y en particular mediante \n\nDeep Learning. Dentro de estos paradigmas han resultado de gran efectividad los LLM o \n\nLarge Language Model que se han popularizado en forma de servicios como ChatGPT u otros similares.\n\nSistemas basados en conocimiento explícito y legible\n\nEsta aproximación se basa en la expresión simbólica de conocimiento de forma que podía ser leído, enlazado y modificado por personas. Y sobre el que se podían programar sistemas inteligentes que consultaban y explotaban este conocimiento. Esta estrategia se encuentra descrita en la entrada \n\nSymbolic y en otras subsecciones como \n\nKnowledge Representation and Reasoning.\n\nLa representación de conocimiento que se usa más intensivamente en estos últimos años se articula en forma de \n\nKnowledge Graphs. Hay diversas propuestas de modelos de grafos sobre los que se pueden recoger relaciones entre conceptos y su categorización.\n\nMuy particularmente, se planteó una iniciativa para propiciar la publicación opcional de estos grafos de conocimiento en la Web por parte de distintas instituciones de forma que cualquiera pueda declarar conexiones explícitas entre ellos. De esta forma, y como se hizo con HTML y la Web usual de documentos, se pretende la construcción  social y descentralizada y de una Web de \n\nDatos Enlazados o \n\nWeb Semántica.\n\nLa publicación de grafos accesibles y enlazables acotaba algunos requisitos sobre cómo debían ser los identificadores de los conceptos enlazados y los modelos de grafos permitidos sobre esta infraestructura Web. El consorcio W3 ha desarrollado todos los estándares necesarios para ello, como el uso común de un tipo de grafo (\n\nRDF), de lenguajes de conceptualización para superponer taxonomías y ontologías (\n\nRDFS y \n\nOWL) o de un lenguaje de consulta y administración de datos como \n\nSPARQL.\n\nSobre el ámbito de este documento\n\nLas secciones de este documento se refieren a los estándares y tecnologías de gestión de grafos de conocimiento tal y como se requieren en la Web Semántica: RDF(S), SPARQL y OWL.\n\nEstas mismas tecnologías se pueden utilizar en el diseño de sistemas inteligentes locales o propios, aunque para estos usos compiten con otros modelos de grafos como p. ej. los \n\nProperty Graphs y otros lenguajes de consulta como p. ej. \n\nCypher.","type":"content","url":"/#contexto","position":3},{"hierarchy":{"lvl1":"Grafos de conocimiento","lvl2":"Sobre este documento"},"type":"lvl2","url":"/#sobre-este-documento","position":4},{"hierarchy":{"lvl1":"Grafos de conocimiento","lvl2":"Sobre este documento"},"content":"Este documento es una introducción al modelado y a la consulta de grafos RDF. Consta de las siguientes partes:\n\nIntroducción a RDF\n\nIntroducción a SPARQL\n\nConsultas de tipo SELECT (sobre NobelPrize)\n\nConsultas de tipo SELECT (sobre Wikidata)\n\nAnexo: breve introducción a OWL","type":"content","url":"/#sobre-este-documento","position":5},{"hierarchy":{"lvl1":"Grafos de conocimiento","lvl2":"Bibliografía comentada"},"type":"lvl2","url":"/#bibliograf-a-comentada","position":6},{"hierarchy":{"lvl1":"Grafos de conocimiento","lvl2":"Bibliografía comentada"},"content":"","type":"content","url":"/#bibliograf-a-comentada","position":7},{"hierarchy":{"lvl1":"Grafos de conocimiento","lvl3":"Libros generalistas y de contexto","lvl2":"Bibliografía comentada"},"type":"lvl3","url":"/#libros-generalistas-y-de-contexto","position":8},{"hierarchy":{"lvl1":"Grafos de conocimiento","lvl3":"Libros generalistas y de contexto","lvl2":"Bibliografía comentada"},"content":"Linked Data for Digital Humanities\n\nLinked Data for Digital Humanities, Nurmikko Fuller, Terhi; 2023, Routledge.\n\nLibro adecuado para una primera aproximación de contexto sobre las tecnologías de la Web Semántica y su utilidad, especialmente para los investigadores en Humanidades Digitales.\n\nThe Accidental Taxonomist (3rd edition)\n\nThe Accidental Taxonomist, Hedden, Heather; 2022, Medford, Information Today Inc. (\n\nWeb del libro)\n\nRecomendable para los interesados en la modelización de metadatos en forma de taxonomías.","type":"content","url":"/#libros-generalistas-y-de-contexto","position":9},{"hierarchy":{"lvl1":"Grafos de conocimiento","lvl3":"Libros técnicos sobre RDF(S), OWL y consultas SPARQL","lvl2":"Bibliografía comentada"},"type":"lvl3","url":"/#libros-t-cnicos-sobre-rdf-s-owl-y-consultas-sparql","position":10},{"hierarchy":{"lvl1":"Grafos de conocimiento","lvl3":"Libros técnicos sobre RDF(S), OWL y consultas SPARQL","lvl2":"Bibliografía comentada"},"content":"Semantic Web for the Working Ontologist\n\nSemantic Web for the Working Ontologist, Allemang, Dean; Hendler, Jim; Gandon, Fabien; 2020, ACM Books\n\nPresenta de forma comprensible las opciones de uso de las tecnologías de la Web de Datos desde una perspectiva aplicada.\n\nLearning Sparql\n\nLearning Sparql (2nd edition), DuCharme, Bob; 2013, O’Really Media.\n\nFacilita una introducción detallada al lenguaje de consulta SPARQL 1.1. El autor mantiene una (\n\nWeb del libro), con recursos y referencias complementarias a su \n\nblog.\n\nWeb of Data\n\nWeb of Data Hogan, Aidan; 2020, Springer.\n\nEs un texto extenso declarativo, informativo, sobre los estándares de la Web Semántica, que describe con muchos ejemplos intercalados. Se puede usar como referencia comentada de estos estándares. En [la página del autor sobre el libro] \n\nhttps://​aidanhogan​.com​/webofdatabook/ se facilitan recursos adicionales, entre los que se encuentra \n\nuna versión pre-print del libro.","type":"content","url":"/#libros-t-cnicos-sobre-rdf-s-owl-y-consultas-sparql","position":11},{"hierarchy":{"lvl1":"Grafos de conocimiento","lvl3":"Referencias técnicas oficiales del W3","lvl2":"Bibliografía comentada"},"type":"lvl3","url":"/#referencias-t-cnicas-oficiales-del-w3","position":12},{"hierarchy":{"lvl1":"Grafos de conocimiento","lvl3":"Referencias técnicas oficiales del W3","lvl2":"Bibliografía comentada"},"content":"RDF(S) 1.1\n\nRDF 1.1 Primer: introducción a RDF que remite a otros documentos ampliatorios.\n\nSPARQL 1.1\n\nSPARQL 1.1 Overview: presentación del lenguaje que remite a su uso como lenguaje de consulta (descrito en \n\nSPARQL 1.1 Query Language) y a su uso como lenguaje de administración de una base de datos RDF (descrito en \n\nSPARQL 1.1 Update).\n\nOWL 2\n\nOWL 2 Primer: introducción al lenguaje OWL para la declaración de ontologías complejas.\n\nSobre las nuevas versiones RDF 1.2 y SPARQL 1.2\n\nRDF 1.2 Primer es una introducción a la nueva especificación RDF del W3, aún en proceso de aprobación. Esta ampliación de RDF permitirá referenciar en un enunciado no sólo a un objeto <o> (como en <s><p><o>) sino a toda una tripleta como objeto (como en <s> <p> <<S P O>>).\n\nEsta ampliación sintáctica y semántica obliga a redefinir el resto de los estándares asociados, como son los diversos formatos de transmisión de tripletas RDF o el lenguaje de consulta.","type":"content","url":"/#referencias-t-cnicas-oficiales-del-w3","position":13},{"hierarchy":{"lvl1":"Grafos de conocimiento","lvl3":"Servicios, herramientas y programación sobre grafos RDF","lvl2":"Bibliografía comentada"},"type":"lvl3","url":"/#servicios-herramientas-y-programaci-n-sobre-grafos-rdf","position":14},{"hierarchy":{"lvl1":"Grafos de conocimiento","lvl3":"Servicios, herramientas y programación sobre grafos RDF","lvl2":"Bibliografía comentada"},"content":"Playgrounds en línea para RDF\n\nHay servicios en línea amigables para analizar, visualizar o cambiar de formato conjuntos de tripletas RDF. Además permiten comprobar que cumplen una estructura declarada por el autor y también se facilita la ejecución de consultas SPARQL sobre estos datasets. Entre estos espacios de pruebas se encuentran:\n\nRDFShape facilitado por el grupo de investigación WESO de la Universidad de Oviedo.\n\nRDF Playground facilitado por la Universidad de Chile.\n\nGestión de ontologías OWL (en línea y localmente)\n\nProtégé, entre otras opciones similares, es el editor de ontologías OWL más utilizado. Permite además todo tipo de acciones de análisis, depuración mediante razonadores y consulta sobre estas ontologías. Se facilita (gratuitamente) como servicio en línea () o como aplicación local.\n\nComo introducción a su uso se puede utilizar la versión del \n\nPizza Tutorial for Protége de Michael DeBellis, así como otras entradas de su \n\nblog.\n\nBases de datos para grafos RDF (y para otros modelos de grafos)\n\nGrafos RDF. Entre otras opciones, para la gestión de datasets RDF se puede utilizar \n\nGraphDB\n\nGraphDB Desktop es una versión gratuita descargable, de instalación inmediata.\n\nProperty Graphs. Entre las bases de datos que usan internamente este modelo se encuentra \n\nNeo4J, también instalable localmente de forma gratuita.\n\nNeo4J Desktop es la versión descargable, también de instalación inmediata como aplicación de escritorio.\n\nComo ocurre con GraphDB, Neo4J facilita una gran diversidad de recursos de aprendizaje y de casos de uso. Entre ellos se encuentran \n\ntextos descargables gratuitamente, como Building Knowledge Graphs: A Practitioner’s Guide.\n\nUna revisión extensa (y muy técnica) sobre los Grafos de Conocimiento en general se puede encontrar en Knowledge Graphs (Aidan Hogan et al, 2021) que se facilita en abierto en la dirección \n\nhttps://kgbook.org\n\nGestión y consulta de grafos RDF (y de ontologías OWL) mediante Python\n\nrdflib es la librería más utilizada para la gestión RDF. Permite cargar enunciados RDF en estructuras Python y consultarlos y administrarlos mediante órdenes SPARQL estándar.\n\nsparqlwrapper se utiliza para enviar consultas a datasets externos (usualmente en la Web Semántica) y para recoger estructuradamente los resultados emitidos desde estos servidores.\n\nowlready2 permite cargar y gestionar ontologías complejas en estructuras Python para su depuración y consulta con ayuda de razonadores. El autor de este paquete escribió un texto sobre este tipo de gestión: \n\nOntologies with Python. Lamy, Jean-Baptiste; 2021, Apress.","type":"content","url":"/#servicios-herramientas-y-programaci-n-sobre-grafos-rdf","position":15},{"hierarchy":{"lvl1":"Avance sobre ontologías OWL"},"type":"lvl1","url":"/owl-intro","position":0},{"hierarchy":{"lvl1":"Avance sobre ontologías OWL"},"content":"Las conceptualizaciones RDFS se pueden detallar más, incorporando nuevas características para las clases y propiedades. OWL permite declarar este tipo de conceptualizaciones en un mismo lenguaje estándar.","type":"content","url":"/owl-intro","position":1},{"hierarchy":{"lvl1":"Avance sobre ontologías OWL","lvl2":"OWL, como ampliación de RDFS"},"type":"lvl2","url":"/owl-intro#owl-como-ampliaci-n-de-rdfs","position":2},{"hierarchy":{"lvl1":"Avance sobre ontologías OWL","lvl2":"OWL, como ampliación de RDFS"},"content":"El lenguaje de conceptualización RDFS no es suficientemente expresivo, por ejemplo:\n\nNo permite declarar que dos clases son disjuntas, es decir, que no pueden tener instancias en común.\n\nTampoco permite declarar que una determinada propiedad es simétrica, es decir, que si ocurre “X prop Y”, debe ocurrir “Y prop X”.","type":"content","url":"/owl-intro#owl-como-ampliaci-n-de-rdfs","position":3},{"hierarchy":{"lvl1":"Avance sobre ontologías OWL","lvl3":"Nuevos constructores en OWL","lvl2":"OWL, como ampliación de RDFS"},"type":"lvl3","url":"/owl-intro#nuevos-constructores-en-owl","position":4},{"hierarchy":{"lvl1":"Avance sobre ontologías OWL","lvl3":"Nuevos constructores en OWL","lvl2":"OWL, como ampliación de RDFS"},"content":"Más expresivo que RDFS. El lenguaje de conceptualización OWL 2 sí que facilita nuevas definiciones y restricciones sobre clases y propiedades. Pero, de nuevo, resulta a su vez limitado: no se pueden añadir todas las restricciones imaginables sobre clases o propiedades.\n\nLímites teóricos estudiados. Esto ocurre porque hay limitaciones teóricas inevitables: en algunos casos, la inferencia con ciertas restricciones resulta indecidible, es decir, sin garantías de que la computación finalice en todo caso. O bien puede resultar computacionalmente demasiado compleja: un ligero aumento en el número de datos procesados puede producir un aumento inasumible en el tiempo de finalización del cálculo.\n\nPara acotar teóricamente la indecibilidad y la complejidad se ha trabajado cuidadosamente sobre la semántica de los constructores OWL añadidos, basados en fragmentos escogidos de la Lógica de Primer Orden (reformulados como Lógicas Descriptivas).","type":"content","url":"/owl-intro#nuevos-constructores-en-owl","position":5},{"hierarchy":{"lvl1":"Avance sobre ontologías OWL","lvl3":"Uso de OWL en la Web de Datos","lvl2":"OWL, como ampliación de RDFS"},"type":"lvl3","url":"/owl-intro#uso-de-owl-en-la-web-de-datos","position":6},{"hierarchy":{"lvl1":"Avance sobre ontologías OWL","lvl3":"Uso de OWL en la Web de Datos","lvl2":"OWL, como ampliación de RDFS"},"content":"Vocabularios ligeros. Los repositorios públicos RDF, en la Red de Datos Abiertos Enlazados (o Web de Datos), mayoritariamente superponen una conceptualización sencilla a sus datos, en forma de vocabularios RDFS.\n\nOntologías complejas. En el otro extremo, hay repositorios muy especializados (públicos o no) que requieren una conceptualización compleja superpuesta. Sería el caso de una taxonomía completa de los seres vivos, con su jerarquía compleja de clases y de propiedades. O de repositorios especializados, por ejemplo, en bioquímica. Para estos casos se utilizan ontologías OWL cuidadosamente diseñadas.\n\nRDFS-Plus. Entre medias, hay un uso creciente de vocabularios RDFS con unas pocas funcionalidades OWL escogidas. RDFS-Plus es una selección concreta de funcionalidades OWL, como extensión de RDFS, que se usa para este nivel de expresividad intermedia.","type":"content","url":"/owl-intro#uso-de-owl-en-la-web-de-datos","position":7},{"hierarchy":{"lvl1":"Avance sobre ontologías OWL","lvl2":"El vocabulario OWL 2"},"type":"lvl2","url":"/owl-intro#el-vocabulario-owl-2","position":8},{"hierarchy":{"lvl1":"Avance sobre ontologías OWL","lvl2":"El vocabulario OWL 2"},"content":"Como ocurre con RDFS, el lenguaje OWL 2 permite declarar vocabularios u ontologías propias con declaraciones estándar sobre las características y restricciones de sus individuos, clases y propiedades.","type":"content","url":"/owl-intro#el-vocabulario-owl-2","position":9},{"hierarchy":{"lvl1":"Avance sobre ontologías OWL","lvl3":"Individuos idénticos o distintos","lvl2":"El vocabulario OWL 2"},"type":"lvl3","url":"/owl-intro#individuos-id-nticos-o-distintos","position":10},{"hierarchy":{"lvl1":"Avance sobre ontologías OWL","lvl3":"Individuos idénticos o distintos","lvl2":"El vocabulario OWL 2"},"content":"Identidad y diferenciación. En OWL se puede declarar que dos instancias, dos identificadores para individuos, son el mismo; es decir, deben siempre interpretarse como referencias al mismo objeto externo. O, por el contrario, también se puede declarar que varios identificadores de individuos son todos ellos entre sí distintos: debe interpretarse cada uno como referencia a un objeto distinto.\n\nClases enumeradas. Con varios elementos distintos se puede además declarar una clase C, compuesta exactamente por esos elementos: C = \\{e_1,...,e_k\\}.","type":"content","url":"/owl-intro#individuos-id-nticos-o-distintos","position":11},{"hierarchy":{"lvl1":"Avance sobre ontologías OWL","lvl3":"Propiedades y sus características","lvl2":"El vocabulario OWL 2"},"type":"lvl3","url":"/owl-intro#propiedades-y-sus-caracter-sticas","position":12},{"hierarchy":{"lvl1":"Avance sobre ontologías OWL","lvl3":"Propiedades y sus características","lvl2":"El vocabulario OWL 2"},"content":"En RDFS, los objetos podían ser identificadores o literales. Esto mismo divide a las propiedades OWL entre Object Properties (con objeto recurso) o Datatype Property (con objeto literal).\n\nCaracterísticas de las propiedades. Dentro de las Object Properties se puede fijar que la propiedad es de cualquiera de estos tipos: transitiva, simétrica, asimétrica, reflexiva, irreflexiva, funcional o con inversa funcional. Por ejemplo, visualizado como un grafo, una relación funcional garantiza que de un nodo sale a lo sumo un enlace a un nodo: no puede ocurrir que salgan dos o más enlaces a nodos distintos. Si la relación es de tipo inversa funcional lo que no puede ocurrir es que a un nodo lleguen dos o más enlaces desde nodos distintos.\n\nCotas universales. Para acotar la jerarquía de clases y subclases, OWL facilita una clase superior (que contiene todo recurso) y otra inferior (que no contiene ninguno). Adicionalmente, para acotar la jerarquía de subpropiedades se define una propiedad superior, aquella que relaciona cada par de individuos. Y, dualmente, también se define la propiedad inferior, aquella que no relaciona ningún individuo con otro.\n\nRelaciones y composiciones entre propiedades. También puede definirse una propiedad como inversa de otra. O declarar que dos propiedades son equivalentes, y por tanto relacionan exactamente los mismos pares de individuos. O, por el contrario, declarar que dos propiedades son disjuntas y no hay ningún par de recursos relacionados por ambas. Asimismo se puede definir una propiedad por composición de otras, por ejemplo, la de ser ‘tío de’ por composición de la relaciones ‘ser hermano de’ y ‘ser padre de’.","type":"content","url":"/owl-intro#propiedades-y-sus-caracter-sticas","position":13},{"hierarchy":{"lvl1":"Avance sobre ontologías OWL","lvl3":"Construcción de clases complejas","lvl2":"El vocabulario OWL 2"},"type":"lvl3","url":"/owl-intro#construcci-n-de-clases-complejas","position":14},{"hierarchy":{"lvl1":"Avance sobre ontologías OWL","lvl3":"Construcción de clases complejas","lvl2":"El vocabulario OWL 2"},"content":"Una ontología OWL puede tener sus clases primitivas, que son identificadores directamente declarados clases. Y adicionalmente se pueden definir nuevas clases mediante dos procesos entrelazables: (1) mediante operaciones sobre clases previas o bien (2) como conjunto de elementos que cumplen cierta restricción, expresada mediante propiedades y clases previas.","type":"content","url":"/owl-intro#construcci-n-de-clases-complejas","position":15},{"hierarchy":{"lvl1":"Avance sobre ontologías OWL","lvl4":"Definición booleana de nuevas clases","lvl3":"Construcción de clases complejas","lvl2":"El vocabulario OWL 2"},"type":"lvl4","url":"/owl-intro#definici-n-booleana-de-nuevas-clases","position":16},{"hierarchy":{"lvl1":"Avance sobre ontologías OWL","lvl4":"Definición booleana de nuevas clases","lvl3":"Construcción de clases complejas","lvl2":"El vocabulario OWL 2"},"content":"Se pueden definir nuevas clases como intersección o unión de dos clases previas o como complementaria de una clase. Así, por ejemplo, se puede definir la clase resultante de “los vertebrados y no marinos, unión con los anélidos”. Y a partir de esta clase se puede definir su complementaria o su unión o intersección con otra, primitiva o compleja.","type":"content","url":"/owl-intro#definici-n-booleana-de-nuevas-clases","position":17},{"hierarchy":{"lvl1":"Avance sobre ontologías OWL","lvl4":"Definición a partir de propiedades y de otras clases","lvl3":"Construcción de clases complejas","lvl2":"El vocabulario OWL 2"},"type":"lvl4","url":"/owl-intro#definici-n-a-partir-de-propiedades-y-de-otras-clases","position":18},{"hierarchy":{"lvl1":"Avance sobre ontologías OWL","lvl4":"Definición a partir de propiedades y de otras clases","lvl3":"Construcción de clases complejas","lvl2":"El vocabulario OWL 2"},"content":"De un elemento, en la representación gráfica de una ontología, pueden o no salir enlaces de una cierta propiedad. Esto permite:\n\nDefinir nuevas clases, que agrupan elementos con una cardinalidad similar de estos enlaces (sin importar dónde acaban)\n\nO refinar estas definiciones exigiendo que además acaben en algún elemento determinado\n\nO que además acaben en elementos de una clase determinada\n\n(n P). En el primer caso, a partir de la propiedad P ‘habla_idioma’ se podría definir la clase de los ‘políglotas’: elementos de los que salen n enlaces (dos o más) de esa propiedad. O la de los ‘bilingües’: elementos de los que salen exactamente dos enlaces (n=2) de esa propiedad.\n\n(P a). En el segundo caso, si se exige que el enlace de tipo P finalice en un determinado elemento a se puede definir la clase de los ‘francófonos’: aquéllos cuyo enlace ‘habla_idioma’ finaliza en el individuo ‘francés’. O, a partir de la propiedad ‘tener_confianza_en’ definir los la clase de los ‘seguros’: aquéllos de los que sale un enlace de esa propiedad que acaba en ellos mismos.\n\n(n P C). De forma parecida a la definición de los ‘políglotas’, con dos o más enlaces ‘habla_idioma’ (sin importar dónde acaban), se puede definir una clase como ‘políglota indoeuropeo’ si se requiere que esos enlaces finalicen en algún idioma de la clase C (idiomas indoeuropeos).\n\n(P C) Un ‘políglota indoeuropeo’, además de hablar dos o más idiomas indoeuropeos, puede quizá hablar idiomas de otra clase. Se puede definir otro tipo de restricción, sin considerar ahora cuántos enlaces salen de un elemento, pero sí exigiendo que todos ellos acaben en la clase C de los idiomas indoeuropeos. Este conjunto de elementos lo serían de una clase que puede llamarse ‘hablante a lo sumo indoeuropeo’: que habla 0, 1, 2 o más idiomas pero todos ellos indoeuropeos. Esa restricción ‘todos ellos acaben en C’ (universal) se puede sustituir por ‘al menos uno de ellos acabe en C’ (existencial) y se podría definir así la clase de los ‘hablantes como mínimo indoeuropeo’, porque habla uno o más idiomas indoeuropeos (y quizá otros, en otras clases).","type":"content","url":"/owl-intro#definici-n-a-partir-de-propiedades-y-de-otras-clases","position":19},{"hierarchy":{"lvl1":"Avance sobre ontologías OWL","lvl2":"Referencias y herramientas"},"type":"lvl2","url":"/owl-intro#referencias-y-herramientas","position":20},{"hierarchy":{"lvl1":"Avance sobre ontologías OWL","lvl2":"Referencias y herramientas"},"content":"","type":"content","url":"/owl-intro#referencias-y-herramientas","position":21},{"hierarchy":{"lvl1":"Avance sobre ontologías OWL","lvl3":"Referencias","lvl2":"Referencias y herramientas"},"type":"lvl3","url":"/owl-intro#referencias","position":22},{"hierarchy":{"lvl1":"Avance sobre ontologías OWL","lvl3":"Referencias","lvl2":"Referencias y herramientas"},"content":"La introducción oficial a OWL 2 se encuentra en:\n\nHitzler, P., Krötzsch, M., Parsia, B., Patel-Schneider, P. F., & Rudolph, S. (2009). \n\nOWL 2 web ontology language primer. W3C recommendation, 27(1), 123.\n\nUn texto público sobre ingeniería ontológica se encuentra disponible en la dirección:\n\nKeet, C. M. (2018). \n\nAn introduction to ontology engineering. University of Cape Town\n\nEl siguiente texto, impreso y no público, contiene una introducción completa y muy comprensible sobre OWL 2:\n\nHogan, A. (2020). Web of data. Springer International Publishing. [Capítulo 5]\n\nSi no se puede acceder al texto anterior, el autor facilita diapositivas propias de sus cursos en la página de apoyo al texto, en \n\nhttps://​aidanhogan​.com​/webofdatabook/.\n\nUn libro completo y con una perspectiva aplicada:\n\nHendler J., Gandon F., Allemang D. (2020) Semantic Web for the Working Ontologist: Effective Modeling for Linked Data, RDFS, and OWL (Third Edition) ACM Books.","type":"content","url":"/owl-intro#referencias","position":23},{"hierarchy":{"lvl1":"Avance sobre ontologías OWL","lvl3":"Editores especializados","lvl2":"Referencias y herramientas"},"type":"lvl3","url":"/owl-intro#editores-especializados","position":24},{"hierarchy":{"lvl1":"Avance sobre ontologías OWL","lvl3":"Editores especializados","lvl2":"Referencias y herramientas"},"content":"Para el diseño de ontologías complejas es preferible disponer de un buen editor especializado. Protégé es el más utilizado para estos fines. Permite gráficamente añadir y gestionar individuos, clases y propiedades. Consta de una gran variedad de módulos activables para la edición, visualización y depuración de ontologías, entre los que se encuentran varios razonadores.\n\nSe puede descargar o ejecutar como servicio en Protégé: \n\nhttps://​protege​.stanford​.edu/\n\nEntre otra documentación, hay dos tutoriales de diseño de ontologías con Protégé: \n\nPizza Tutorial y \n\nPeople Example Ontology","type":"content","url":"/owl-intro#editores-especializados","position":25},{"hierarchy":{"lvl1":"Avance sobre ontologías OWL","lvl3":"Paquetes Python","lvl2":"Referencias y herramientas"},"type":"lvl3","url":"/owl-intro#paquetes-python","position":26},{"hierarchy":{"lvl1":"Avance sobre ontologías OWL","lvl3":"Paquetes Python","lvl2":"Referencias y herramientas"},"content":"La gestión de tripletas RDF se puede realizar completamente mediante paquetes Python como \n\nrdflib. Para el uso, más avanzado, de ontologías OWL se puede utilizar el paquete \n\nOwlready2, que permite no sólo definir y gestionar la ontología sino insertarla en una aplicación que la explote para alguna finalidad determinada.\n\nUn libro dedicado a la creación de ontologías con OWLReady2 es:\n\nLamy Jean-Baptiste (2020) Ontologies with Python: Programming OWL 2.0 Ontologies with Python and Owlready2. Apress","type":"content","url":"/owl-intro#paquetes-python","position":27},{"hierarchy":{"lvl1":"Avance sobre ontologías OWL","lvl3":"Bases de datos especializadas","lvl2":"Referencias y herramientas"},"type":"lvl3","url":"/owl-intro#bases-de-datos-especializadas","position":28},{"hierarchy":{"lvl1":"Avance sobre ontologías OWL","lvl3":"Bases de datos especializadas","lvl2":"Referencias y herramientas"},"content":"Las bases de datos orientadas a grafos se pueden clasificar conforme al modelo de grafo que gestionan. Entre las que administran tripletas RDF se encuentran por ejemplo \n\nGraphDB, que puede incorporar \n\nontologías en GraphDB. Gestores de otros modelos de grafos, como \n\nNeo4J permiten \n\nincorporar ontologías, en este caso a través del módulo \n\nNeosemantics.\n\nLa explotación desde una aplicación externa de estas ontologías, albergadas en bases de datos, requiere APIs de acceso. \n\nGraphDB facilita varias APIs de acceso, así como \n\nNeo4J.","type":"content","url":"/owl-intro#bases-de-datos-especializadas","position":29},{"hierarchy":{"lvl1":"Cómo transmitir grafos RDF"},"type":"lvl1","url":"/rdf-formatos","position":0},{"hierarchy":{"lvl1":"Cómo transmitir grafos RDF"},"content":"El siguiente diagrama visualiza las relaciones entre datos en un grafo RDF. En este caso, para acortar los identificadores se asume que el prefijo u: es una abreviatura de http://datos.uned.es/ej/\n\nEjemplo de grafo RDFEflowchart TD\n    Q(u:Quijote) -->|u:autor| C(u:Cervantes)\n    N(u:Novelas_ejemplares) -->|u:autor| C\n    C -->|u:lugar_nacimiento| A(u:Alcalá_de_Henares)\n    C -->|u:fecha_nacimiento| F[[\"29/09/1547\"]]\n    A -->|u:comparte_frontera| M(u:Meco)\n    A -->|u:comparte_frontera| T(u:Torrejón de Ardoz)\n\nHay varias sintaxis posibles para describir este grafo textualmente, de forma secuencial. En esta sección tan sólo se introduce la familia de sintaxis Turtle:\n\nN-Triples (y N-Quads): la más adecuada para la transmisión explícita de enunciados entre máquinas (y por tanto, la menos legible por personas)\n\nTurtle (y TriG): la más directamente comprensible por personas\n\nOtras dos sintaxis utilizadas, algo menos legibles que Turtle, son JSON-LD y RDF/XML. Todas ellas aparecen brevemente descritas en la introducción oficial a RDF del consorcio W3: \n\nRDF 1.1 Primer.","type":"content","url":"/rdf-formatos","position":1},{"hierarchy":{"lvl1":"Cómo transmitir grafos RDF","lvl2":"Dos formatos RDF sugeridos"},"type":"lvl2","url":"/rdf-formatos#dos-formatos-rdf-sugeridos","position":2},{"hierarchy":{"lvl1":"Cómo transmitir grafos RDF","lvl2":"Dos formatos RDF sugeridos"},"content":"N-Triples es el formato más explícito de secuenciación de datos RDF, muy adecuado para la transmisión de datos entre máquinas pero muy poco legible para una persona.\n\nTurtle es una derivación de este formato con facilidades sintácticas añadidas que producen una secuenciación más concisa y mucho más legible y comprensible.","type":"content","url":"/rdf-formatos#dos-formatos-rdf-sugeridos","position":3},{"hierarchy":{"lvl1":"Cómo transmitir grafos RDF","lvl3":"N-Triples","lvl2":"Dos formatos RDF sugeridos"},"type":"lvl3","url":"/rdf-formatos#n-triples","position":4},{"hierarchy":{"lvl1":"Cómo transmitir grafos RDF","lvl3":"N-Triples","lvl2":"Dos formatos RDF sugeridos"},"content":"El \n\nejemplo de grafo RDF inicial se puede secuenciar como sigue.\n\nEnunciados RDF en formato N-Triples<http://datos.uned.es/ej/Quijote> <http://datos.uned.es/ej/tiene_autor> <http://datos.uned.es/ej/Cervantes> .\n<http://datos.uned.es/ej/Novelas_ejemplares> <http://datos.uned.es/ej/tiene_autor> <http://datos.uned.es/ej/Cervantes> .\n<http://datos.uned.es/ej/Cervantes> <http://datos.uned.es/ej/lugar_nacimiento> <http://datos.uned.es/ej/Alcala_de_Henares> .\n<http://datos.uned.es/ej/Cervantes> <http://datos.uned.es/ej/fecha_nacimiento> \"29/09/1547\" .\n<http://datos.uned.es/ej/Alcala_de_Henares> <http://datos.uned.es/ej/comparte_frontera> <http://datos.uned.es/ej/Meco> .\n<http://datos.uned.es/ej/Alcala_de_Henares> <http://datos.uned.es/ej/comparte_frontera> <http://datos.uned.es/ej/Torrejon_de_Ardoz> .\n\nCada enunciado se expresa en una línea, finalizada por un punto. Los términos del enunciado que son identificadores muestran el identificador por completo y encerrado entre corchetes angulares. Los términos que son literales se muestran encerrados entre comillas. Los nodos en blanco se expresan como, por ejemplo, el término _:xb (con un nombre cualquiera interno como es xb).\n\nActividad propuesta\n\nPara comprobar la correcta sintaxis de los enunciados anteriores se sugiere utilizar el servicio RDFShape (en \n\nhttps://​rdfshape​.weso​.es):\n\nSe pueden copiar los enunciados anteriores y pegarlos en RDFShape en su pestaña \n\nRDF :: Analysis and Visualization\n\nSe debe especificar que el formato de los enunciados en N-Triples. Como inferencia se debe escoger None.\n\nEl sistema analiza sintácticamente el texto pegado, detecta que consta de 6 enunciados y facilita la visualización de sus datos en dos tipos de presentación distintos.","type":"content","url":"/rdf-formatos#n-triples","position":5},{"hierarchy":{"lvl1":"Cómo transmitir grafos RDF","lvl3":"Turtle","lvl2":"Dos formatos RDF sugeridos"},"type":"lvl3","url":"/rdf-formatos#turtle","position":6},{"hierarchy":{"lvl1":"Cómo transmitir grafos RDF","lvl3":"Turtle","lvl2":"Dos formatos RDF sugeridos"},"content":"La \n\nsecuenciación anterior, en formato N-Triples, se puede expresar de forma mucho más concisa y legible utilizando las convenciones del formato Turtle:\n\nEnunciados RDF en formato TurtlePREFIX u: <http://datos.uned.es/ej/>\n\nu:Quijote u:autor u:Cervantes .\nu:Novelas_ejemplares u:autor u:Cervantes .\nu:Cervantes u:lugar_nacimiento u:Alcala_de_Henares ;\n            u:fecha_nacimiento \"29/09/1547\" .\nu:Alcala_de_Henares u:comparte_frontera u:Meco, u:Torrejon_de_Ardoz .\n\nLos términos que son identificadores resultan ahora más legibles porque se abrevia la parte inicial del identificador como u:, que se declara inicialmente sustituto del prefijo <http://datos.uned.es/ej/>.\n\nEl primer enunciado con Cervantes como sujeto acaba en punto y coma. El punto y coma indica que comienza otro nuevo enunciado que mantiene implícitamente el sujeto del anterior (Cervantes).\n\nEl primer enunciado con Alcala_de_Henares como sujeto acaba en coma. La coma indica que comienza otro nuevo enunciado que mantiene implícitos tanto el sujeto como la propiedad del anterior (Cervantes comparte_frontera).\n\nActividad propuesta\n\nRDFShape facilita un conversor entre formatos RDF. Para familiarizarse con su uso se propone:\n\nCopiar los enunciado Turtle anteriores y pegarlos en su pestaña \n\nRDF :: Conversion\n\nEspecificar como formato de entrada Turtle y como formato de salida N-Triples (con inferencia None). Se puede comprobar si esta salida coincide con la secuenciación N-Triples facilitada anteriormente en este texto para el mismo grafo.","type":"content","url":"/rdf-formatos#turtle","position":7},{"hierarchy":{"lvl1":"Cómo transmitir grafos RDF","lvl2":"Otras opciones de secuenciación"},"type":"lvl2","url":"/rdf-formatos#otras-opciones-de-secuenciaci-n","position":8},{"hierarchy":{"lvl1":"Cómo transmitir grafos RDF","lvl2":"Otras opciones de secuenciación"},"content":"Como ampliación de actividad anterior, se puede solicitar en RDFShape la conversión a otros formatos del mismo grafo RDF.\n\nLos formatos RDF se presentan brevemente en \n\nRDF 1.1 Primer (5. Writing RDF graphs).\n\nUna exposición más detallada se encuentra en \n\nWeb of Data, secc. 3.8 (2020, Aidan Hogan).","type":"content","url":"/rdf-formatos#otras-opciones-de-secuenciaci-n","position":9},{"hierarchy":{"lvl1":"El modelo de datos RDF"},"type":"lvl1","url":"/rdf-modelo-datos","position":0},{"hierarchy":{"lvl1":"El modelo de datos RDF"},"content":"Avance\n\nLos enunciados RDF son estructuras compuestas por tres términos RDF. Estos enunciados se pueden agregar en conjuntos de enunciados, que son representables de forma directa como grafos.\n\nEnunciado (terna, tripleta). Un enunciado  es una secuencia de tres términos como la que sigue: <El Quijote> <tiene por autor> <Cervantes>. Los enunciados también se denominan ternas o tripletas.\n\nSujeto, predicado (o propiedad) y objeto. Por su posición en la secuencia, los componentes de un enunciado se etiquetan como <sujeto><predicado><objeto>. El predicado también se conoce alternativamente como propiedad.\n\nConjunto de enunciados (grafo). Los enunciados (concisos y autocontenidos) se pueden agregar en conjuntos de enunciados. Estos conjuntos se representan de forma directa como grafos.\n\nEjemplo (informal) de grafo RDF\n\nUna base de conocimiento sobre obras y autores puede ir acumulando ternas como las que siguen.<El Quijote> <tiene autor> <Cervantes> .\n<Novelas ejemplares> <tiene autor> <Cervantes> .\n<Cervantes> <tiene lugar nacimiento> <Alcalá de Henares> .\n\nEste conjunto de enunciados se puede representar como el siguiente grafo.flowchart LR\n    Q(El Quijote) -->|tiene autor| C(Cervantes)\n    N(Novelas ejemplares) -->|tiene autor| C\n    C -->|tiene lugar nacimiento| A[Alcalá de Henares]","type":"content","url":"/rdf-modelo-datos","position":1},{"hierarchy":{"lvl1":"El modelo de datos RDF","lvl2":"Términos RDF"},"type":"lvl2","url":"/rdf-modelo-datos#t-rminos-rdf","position":2},{"hierarchy":{"lvl1":"El modelo de datos RDF","lvl2":"Términos RDF"},"content":"Avance\n\nUn enunciado es una secuencia de tres términos, pero ¿qué es un termino RDF?\nUn término sólo es, de forma excluyente, o bien un identificador o bien un literal o bien un nodo en blanco.\n\nEn principio, las tres posiciones de la terna contienen identificadores salvo las siguientes excepciones:\n\nse puede utilizar un literal tan sólo en la tercera posición\n\nse puede utilizar un nodo en blanco tan sólo en la primera o  en la tercera posición\\left\\{\n\\begin{array}{c}\nidentificador \\\\\nblanco\n\\end{array}\\right\\}\\ \n\\left\\{\n\\begin{array}{c}\nidentificador\n\\end{array}\\right\\}\\ \n\\left\\{\n\\begin{array}{c}\nidentificador \\\\\nliteral \\\\\nblanco\n\\end{array}\\right\\}","type":"content","url":"/rdf-modelo-datos#t-rminos-rdf","position":3},{"hierarchy":{"lvl1":"El modelo de datos RDF","lvl3":"Identificadores","lvl2":"Términos RDF"},"type":"lvl3","url":"/rdf-modelo-datos#identificadores","position":4},{"hierarchy":{"lvl1":"El modelo de datos RDF","lvl3":"Identificadores","lvl2":"Términos RDF"},"content":"En principio (salvo literales o nodos en blanco, donde se puedan utilizar), cada término de un enunciado RDF consta de un identificador universalmente único.\n\nMotivación\n\nLa identificación unívoca de cada término se deriva, como requisito, del uso previsto para estos enunciados RDF en una Web de Datos públicos y enlazados.\n\nPor un lado, el modelo de datos RDF pretende facilitar la publicación de ternas propias en la Web, de forma autónoma y descentralizada.\n\nPor otro lado, se desea posibilitar la referencia a enunciados externos, bien como complemento sugerido a los enunciados propios o para (re)utilizar esos mismos términos internamente, asumiendo la semántica que se les asignó.\n\nSobre la necesidad de identificadores universales\n\n‘Barroco’ para la institución A. Por un lado, la institución A mantiene públicamente varios enunciados sobre un concepto histórico que denomina internamente Barroco, conforme lo entiende y lo modela esa institución. En concreto, lo puede relacionar con otro término propio como Renacimiento utilizando cierta relación propia con una determinada semántica asignada.<Barroco> <precedido por> <Renacimiento> .\n\n‘Barroco’ para la institución B. Por otro lado, la institución B publica un mapa de bares de una ciudad en forma de enunciados RDF, entre los que se encuentra también <Barroco> <precedido por> <Renacimiento> porque ese primer bar se localiza antes (conforme a la numeración de la calle) y en la misma acera que el segundo.\n\nEn una infraestructura de datos pública con acceso a estos dos repositorios, conviene separar los enunciados sobre Barroco (o los que utilizan precedido por) de una institución y de la otra. Incluso si una tercera institución C mantuviera sus propios enunciados sobre movimientos culturales, convendría también singularizarlos de forma separada.\n\nUn mecanismo de desambiguación: prefijos únicos por institución. Esta identificación requerida se puede resolver utilizando ciertos prefijos asignados de forma centralizada a cada institución: así <idA-Barroco> sería universalmente distinguible de <idB-Barroco> si la secuencia de caracteres que componen el prefijo idA no coincide con el prefijo asignado a ninguna otra institución.\n\nURLs como identificadores\nYa existe en la organización de la Web un esquema de construcción de identificadores únicos: el que se utiliza para la asignación de direcciones web o URLs (Uniform Resource Locator), que además conduce ‘físicamente’ hacia ese recurso.\n\nDe esta forma, un potencial repositorio de enunciados en la UNED podría etiquetar unívocamente uno de sus términos como <http://datos.uned.es/recursos/Barroco> o con cualquier otra variante escogida discrecionalmente por la institución dentro del dominio uned.es, como <http://www.uned.es/historia/Barroco>.\n\nSobre este proceso de etiquetado URL de los términos de un enunciado conviene hacer un par de puntualizaciones que se enmarcan en el siguiente desplegable.\n\nSobre identificadores que son o no son localizadores de páginas\n\nLocalizadores URLs. RDF no requiere que esos identificadores conduzcan a una página existente en la Web, que es el uso previsto para una URL. Es suficiente con la garantía de unicidad universal del identificador creado. Sin embargo, para el uso final de enunciados RDF en la Web Semántica, sí que se recomienda que la URL del identificador conduzca a una página donde se ofrezcan detalles adicionales sobre ese término.\n\nIdentificadores que no son localizadores. Las URLs son sólo un subconjunto de los identificadores admitidos para términos RDF. Forman parte de una especificación más general conocida como URI (Uniform Resource Identifiers), entre los que se encuentran esquemas de identificadores como el isbn entre otros. Y a su vez las URIs son sólo un subconjunto de los identificadores IRIs (Intenationalized Resource Identifier), en los que se permite la aparición de cualquier caracter internacional. Estos identificadores no-localizadores pueden encontrarse en algún conjunto de datos RDF ocasionalmente.","type":"content","url":"/rdf-modelo-datos#identificadores","position":5},{"hierarchy":{"lvl1":"El modelo de datos RDF","lvl3":"Literales","lvl2":"Términos RDF"},"type":"lvl3","url":"/rdf-modelo-datos#literales","position":6},{"hierarchy":{"lvl1":"El modelo de datos RDF","lvl3":"Literales","lvl2":"Términos RDF"},"content":"Los dos siguientes enunciados afirman tanto la fecha de nacimiento como el lugar de nacimiento de Miguel de Cervantes:<Cervantes> <tiene fecha nacimiento> \"29/09/1547\" .\n<Cervantes> <tiene lugar nacimiento> \"Alcalá de Henares\"\n\nEn ambos enunciados se aprovecha la opción de almacenar un contenido literal en el objeto del enunciado. Esta es una práctica usual y RDF, para automatizar mejor la comprensión de estos literales, permite añadir a cada uno opcionalmente el idioma en que se expresa o el tipo de dato al que pertenece (una fecha, un número entero, etc). Usando estos complementos a los literales, los enunciados anteriores se pueden expresar como:<Cervantes> <tiene fecha nacimiento> \"29/09/1547\"^^xsd:date .\n<Cervantes> <tiene lugar nacimiento> \"Alcalá de Henares\"@es .\n\nA efectos futuros de búsqueda, los literales sin y con esta información complementaria no se consideran iguales; es decir, “Alcalá de Henares” no resulta ser el mismo literal que “Alcalá de Henares”@es.\n\nDos opciones de modelado para referir a un mismo concepto. En un ejemplo anterior se sugirió el uso de una URL para identificar al concepto Alcalá de Henares, mientras que en este ejemplo se ha utilizado un literal en español que refiere a esa ciudad. Es decir, se han mostrado dos opciones de modelización con sintaxis RDF distinta:<http://ejemp.uned.es/Cervantes> <http://ejemp.uned.es/tiene_lugar_nacimiento> <http://ejemp.uned.es/Alcala_de_Henares> .\n<http://ejemp.uned.es/Cervantes> <http://ejemp.uned.es/tiene_lugar_nacimiento> \"Alcalá de Henares\"@es .\n\nSobre la elección entre identificadores o literales en el objeto\n\nReferencia a un concepto utilizando un literal. Un literal, en un determinado idioma, remite a la comprensión de ese texto por el lector (sea humano o automático); es decir, a la asignación semántica usual de esos caracteres al concepto al que referencian en ese idioma.\n\nReferencia a un concepto utilizando un identificador. Un identificador, en principio, no tiene esta sobrecarga semántica añadida. El identificador UNED para “Alcalá de Henares” podría ser tan abstracto como <http://ejemp.uned.es/X2795B>. La semántica fijada para este término en este repositorio emergerá del conjunto de enunciados que tienen a ese identificador como sujeto. Estos enunciados pueden ir codificando, de forma más o menos legible, que ese término es una ciudad, que tiene X habitantes, que pertenece a la provincia Y o que su alcalde o alcadesa actual es Z.\n\nIdentificador: opción obligatoria si ese concepto es sujeto de otros enunciados. La sintaxis RDF no permite utilizar literales como sujetos de enunciados. De esta forma, si se va a añadir información complementaria sobre “Alcalá de Henares” en este repositorio no hay otra opción: es obligatorio hacerlo sobre un identificador para ese concepto. Y, en este caso, es más que recomendable codificar que Cervantes nació en (la ciudad asociada a) ese identificador, del que se dispone de información complementaria.flowchart LR\n    Q(El Quijote) -->|tiene autor| C(Cervantes)\n    N(Novelas ejemplares) -->|tiene autor| C\n    C -->|tiene lugar nacimiento| A(Alcalá de Henares)\n    A -->|en provincia| M(Madrid)\n\nEl uso de literales ‘ahorra’ identificadores. Una fecha especial, como el 14 de julio de 1789 para los franceses, se podría codificar con un identificador si va a ser sujeto de enunciados. Pero parece un ‘derroche’ de identificadores utilizar uno para cada fecha, día tras día. Esto justifica el uso de literales para información complementaria (situada en el objeto) si ese término no se va a utilizar como sujeto de algún otro enunciado.","type":"content","url":"/rdf-modelo-datos#literales","position":7},{"hierarchy":{"lvl1":"El modelo de datos RDF","lvl3":"Nodos en blanco","lvl2":"Términos RDF"},"type":"lvl3","url":"/rdf-modelo-datos#nodos-en-blanco","position":8},{"hierarchy":{"lvl1":"El modelo de datos RDF","lvl3":"Nodos en blanco","lvl2":"Términos RDF"},"content":"Un nodo en blanco no contiene un literal ni tampoco un identificador universal. Puede servir para representar el enunciado “uno de los vehículos de Antonio no tiene la ITV en vigor” o “Antonio posee un vehículo X tal que X no tiene la ITV en vigor”<http://ejemp.uned.es/Antonio> <http://ejemp.uned.es/posee_vehiculo> _:x .\n_:x <http://ejemp.uned.es/itv_en_vigor> \"false\"^^xsd:boolean .flowchart LR\n    A(Antonio) -->|posee vehículo| X( )\n    X -->|itv en vigor| F[\"Falso\"]\n\nToda aplicación que gestione estos enunciados efectivamente asigna un identificador interno al nodo _:x para confirmar que el nodo objeto del primer enunciado es el mismo que el nodo sujeto del segundo enunciado. Pero ese identificador interno puede ser modificado consistentemente por la aplicación cuando lo necesite, para su gestión propia, y no es público ni sirve para referenciar externamente a ese nodo en blanco en este repositorio.\n\nLos nodos en blanco tienen otros usos avanzados, que se expondrán más adelante.","type":"content","url":"/rdf-modelo-datos#nodos-en-blanco","position":9},{"hierarchy":{"lvl1":"El modelo de datos RDF","lvl2":"Conjuntos de enunciados (grafos)"},"type":"lvl2","url":"/rdf-modelo-datos#conjuntos-de-enunciados-grafos","position":10},{"hierarchy":{"lvl1":"El modelo de datos RDF","lvl2":"Conjuntos de enunciados (grafos)"},"content":"En su gestión más sencilla, los enunciados RDF se pueden ir agregando incrementalmente en un mismo documento o dataset. Todos esos enunciados constituyen un mismo grafo RDF, sin nombre asignado, que se conoce como grafo por defecto (default graph) del dataset.\n\nPara organizar la gestión es posible escoger un subconjunto de esos enunciados y agruparlos en un grafo con un nombre asignado. Así, un dataset puede contener varios conjuntos de enunciados distintos (cada uno con su nombre) y el resto de enunciados en su grafo por defecto (sin nombre), que debe ser único.\n\nComo nombre de grafo se utilizan de nuevo identificadores URLs (o IRIs, en general).","type":"content","url":"/rdf-modelo-datos#conjuntos-de-enunciados-grafos","position":11},{"hierarchy":{"lvl1":"Cómo categorizar datos RDF"},"type":"lvl1","url":"/rdf-vocabularios","position":0},{"hierarchy":{"lvl1":"Cómo categorizar datos RDF"},"content":"En un conjunto de enunciados RDF pueden aparecer diversos autores (Cervantes, Lorca, ...) relacionados con sus obras (Quijote, Yerma, Poeta en Nueva York, ...) o con sus lugares de nacimiento (Alcalá de Henares, Madrid, Fuente Vaqueros, Granada, España, ...). Sin embargo, los ejemplos RDF mostrados hasta este punto no asignan explícitamente términos a clases como obras, personas o lugares.","type":"content","url":"/rdf-vocabularios","position":1},{"hierarchy":{"lvl1":"Cómo categorizar datos RDF","lvl2":"Pertenencia e inclusión"},"type":"lvl2","url":"/rdf-vocabularios#pertenencia-e-inclusi-n","position":2},{"hierarchy":{"lvl1":"Cómo categorizar datos RDF","lvl2":"Pertenencia e inclusión"},"content":"El modelo de datos RDF incorpora una ampliación conocida como RDFS (RDF Schema) que permite añadir a un grafo RDF otros enunciados que categorizan sus términos. De momento, y de manera informal, se muestra un grafo que hace uso de esa ampliación sintáctica.\n\nEjemplo de grafo RDF(S) con clases y subclases declaradasflowchart TD\n    Q(u:Quijote) -->|u:autor| C(u:Cervantes)\n    Y(u:Yerma) -->|u:autor| L(u:Lorca)\n    Q -->|de tipo| N[u:Obra narrativa]\n    Y -->|de tipo| D[u:Obra dramática]\n    N -->|subclase de| O[u:Obra literaria]\n    D -->|subclase de| O\n    O -->|subclase de| A[u:Obra artística]\n\nDel diagrama anterior conviene resaltar los siguientes detalles:\n\nRelación entre entidades. Quijote y Cervantes son dos entidades, con una relación tiene_autor de la primera a la segunda. Lo mismo ocurre con Yerma y Lorca.\n\nEn la modelización de un grafo los autores pueden proponer las relaciones que consideren adecuadas entre entidades, con el nombre que deseen.\n\nPertenencia a una clase. El elemento Quijote pertenece a la clase Obra narrativa, que es un concepto que agrupa éste y otros elementos similares. También se afirma que Yerma pertenece a la clase Obra dramática.\n\nEs la única relación posible entre un elemento y una clase: la pertenencia de un elemento a una clase. Esta relación, con ese significado (‘es un’, ‘es de tipo’, ‘pertenece a’), se requiere en el modelado de casi todos los grafos RDF compartidos en la Web de Datos Enlazados. Y por tanto, el lenguaje RDF facilita un identificador prefijado para esta relación de pertenencia, de uso común en todo grafo.\n\nInclusión, ser subclase de otra clase. En el diagrama anterior aparecen otras clases, como por ejemplo, Obra literaria. A esta clase, como a cualquier otra, se pueden asignar directamente elementos pero no ocurre así en el ejemplo anterior. Adicionalmente, se puede afirmar, como sí ocurre, que una clase como Obra dramática es subclase de Obra literaria; es decir, que todo elemento asignado a Obra dramática también cumple con lo que se requiere para pertenecer a Obra literaria.\n\nEs la única relación reconocida como posible entre una clase y otra clase: la inclusión de una clase en otra. Esta relación, con este significado, aparece en el modelado de cualquier grafo sobre el que se quiere superponer una taxonomía, una jerarquía de clases. El lenguaje RDF facilita un identificador prefijado para esta relación de inclusión, de uso común.\n\nIdentificadores comunes para todo grafo RDF\n\nPara expresar la pertenencia de un elemento a una clase o la inclusión de una clase en otra es obligatorio utilizar los siguientes identificadores:\n\nrdf:type (es un, pertenece a, es de tipo):\n\n<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>\n\nrdfs:subClassOf (está incluida en, es subclase de):\n\n<http://www.w3.org/2000/01/rdf-schema#subClassOf>\n\nNota. RDFS proporcionará otros identificadores de uso común para conceptualizar términos. Todos ellos comienzan su URI con el prefijo rdfs:, que abrevia el inicio de dirección http://​www​.w3​.org​/2000​/01​/rdf​-schema#. Tan sólo rdf:type (y rdf:Property), por razones históricas, se fijaron inicialmente con la dirección asociada al prefijo rdf:.\n\nEl siguiente desplegable muestra, en formato Turtle, los enunciados \n\ndel diagrama inicial.\n\nUso de los identificadores ‘de tipo’ y ‘subclase’PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX u: <http://datos.uned.es/ej/>\n\nu:Quijote u:autor u:Cervantes ;\n          rdf:type u:Obra_narrativa .\nu:Yerma u:autor u:Lorca ;\n        rdf:type u:Obra_dramatica .\nu:Obra_narrativa rdfs:subClassOf u:Obra_literaria .\nu:Obra_dramatica rdfs:subClassOf u:Obra_literaria .\n\nNota 1. Las declaraciones iniciales de prefijo también se pueden expresar sintáticamente como sigue: @prefix rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> .\n\nNota 2 (sobre rdf:type en Turtle). Para expresar que ‘I es del tipo (o es un) C’, Turtle permite reemplazar rdf:type por a (‘es_un’). Así, ‘I a C’ es otra forma de expresar ‘I rdf:type C’.","type":"content","url":"/rdf-vocabularios#pertenencia-e-inclusi-n","position":3},{"hierarchy":{"lvl1":"Cómo categorizar datos RDF","lvl2":"RDFS: opciones para categorizar"},"type":"lvl2","url":"/rdf-vocabularios#rdfs-opciones-para-categorizar","position":4},{"hierarchy":{"lvl1":"Cómo categorizar datos RDF","lvl2":"RDFS: opciones para categorizar"},"content":"Los dos identificadores citados, el de pertenencia a una clase y el de inclusión de una clase en otra, son los identificadores reservados más utilizados. Pero RDFS facilita algunos más, entre los que conviene resaltar los siguientes.\n\nTable 1:Identificadores RDF(S) para la categorización de términos\n\n\n\n\n\nC rdf:type rdfs:Class\n\nC se declara explícitamente como clase\n\nI rdf:type C\n\nI pertenece a la clase C\n\nC1 rdfs:subClassOf C2\n\nLa clase C1 es subclase de la C2\n\nP rdf:type rdf:Property\n\nP se declara explícitamente propiedad\n\nP1 rdfs:subPropertyOf P2\n\nP1 es una subpropiedad de P2\n\nP rdfs:domain C\n\nP tiene por dominio la clase C\n\nP rdfs:range C\n\nP tiene por rango la clase C\n\nEl uso de estos identificadores en la construcción de enunciados se debe ajustar a la siguiente semántica:\n\nSubclase. Cuando se declara que ‘C1 es subclase de C2’ se está afirmando que todo elemento de C1 debe ser considerado también elemento de C2. Por ejemplo, una taxonomía zoológica podría incluir el enunciado ‘Mamíferos subclase_de Vertebrados’.\n\nSubpropiedad. Cuando se declara que ‘P1 es subpropiedad de P2’ se está afirmando que todo par de elementos (I1,I2) relacionados por P1 también están relacionados por P2. Por ejemplo, se puede considerar que la propiedad P1 ‘es_hijo_de’ es una subpropiedad de P2 ‘es_familiar_de’.\n\nDominio y rango de una propiedad.Cualquier propiedad P se usa para relacionar un sujeto con un objeto: <sujeto> <P> <objeto>, como en ‘<I1> <es_creador_de> <I2>’.Cuando se declara que el dominio de P es una clase C1 se está afirmando que todo sujeto en la relación <s><P><o> debe considerarse de la clase C1. Así, se podría fijar explícitamente que el dominio de ‘es_creador_de’ es la clase ‘Persona’.Cuando se declara que el rango de P es una clase C2 se está afirmando que todo objeto en la relación <s><P><o> debe considerarse de la clase C2. Así, se podría fijar explícitamente que el rango de ‘es_creador_de’ es la clase ‘Obra_artística’.\n\nRDFS facilita algunos identificadores de uso más técnico, que se utilizan de forma menos generalizada. En esta introducción tan sólo se menciona entre ellos a rdfs:label, que sirve para adjuntar una etiqueta textual a un nodo.\n\nEtiquetas textuales (rdfs:label). Un repositorio RDF puede optar porque sus identificadores sean no legibles (en ningún idioma), como por ejemplo u:M2347. Los dos siguientes enunciados (en Turtle) añaden a este identificador la etiqueta ‘Londres’ (en español) y la etiqueta ‘London’ en inglés:u:M2347 rdfs:label \"Londres@es , \"London\"@en .\n\nRelación de todos los identificadores en RDFS\n\nLa relación completa se puede encontrar en el documento del W3 \n\nRDFS Schema 1.1. Los identificadores más relevantes para un modelador o consultor de grafos RDF ya se han expuesto. Quedan otros que son de interés a más bajo nivel, para las aplicaciones que gestionan esa información.","type":"content","url":"/rdf-vocabularios#rdfs-opciones-para-categorizar","position":5},{"hierarchy":{"lvl1":"Cómo categorizar datos RDF","lvl2":"Expresividad e inferencia RDFS"},"type":"lvl2","url":"/rdf-vocabularios#expresividad-e-inferencia-rdfs","position":6},{"hierarchy":{"lvl1":"Cómo categorizar datos RDF","lvl2":"Expresividad e inferencia RDFS"},"content":"Un conjunto de enunciados consta, en principio, de sus tripletas explícitamente escritas. De la aceptación de estas tripletas explícitas se pueden deducir  otras conforme a las reglas de inferencia RDFS, que deben aceptarse irremediablemente porque son consecuencia de las anteriores. Un razonador RDFS añadiría estas nuevas tripletas deducidas.\n\nPuede ocurrir que de este nuevo conjunto ampliado, utilizando de nuevo las reglas de inferencia RDFS, se deduzcan nuevas tripletas. Este proceso iterativo de explicitación de consecuencias se puede continuar hasta que no se añada ninguna tripleta adicional.\n\nA continuación se enumeran las reglas de inferencia RDFS más relevantes. Una descripción más técnica y detallada se puede encontrar en la \n\nsecc. 4.4 del texto Web of Data (Aidan Hogan, 2020).\n\nSi un elemento es de tipo C entonces se deduce como clase\n\nEs posible asignar la pertenencia de un elemento I a una clase C que no ha sido declarada explícitamente como clase. Cuando esto ocurre, hay una regla de inferencia que deduce (implícitamente) la declaración de C como clase.\\text{<I> <rdf:type> <C>}\\quad \\Rightarrow \\quad \\text{<C> <rdf:type> <rdfs:Class>}\n\nA C2 pertenecen todos los elementos de su subclase C1\n\nSi C1 es subclase de C2 (porque se ha declarado así o se inferido como tal), de todo elemento explícitamente asignado a C1 se puede deducir que pertenece a C2. \\left.\n \\begin{array}{c}\n   \\text{<C1> <rdf:subClassOf> <C2>} \\\\\n   \\text{<I> <rdf:type> <C1>}\n \\end{array}\n \\right\\rvert \\Rightarrow  \\text{<I> <rdf:type> <C2>}\n\nLa inclusión de clases C1 \\subseteq C2 \\subseteq C3 es transitiva\n\nSi C1 es subclase de C2 y también C2 es subclase de C3 entonces se puede deducir que C1 es subclase de C3. \\left.\n \\begin{array}{c}\n   \\text{<C1> <rdfs:subClassOf> <C2>} \\\\\n   \\text{<C2> <rdfs:subClassOf> <C3>}\n \\end{array}\n \\right\\rvert  \\Rightarrow  \\text{<C1> <rdfs:subClassOf> <C3>}\n\nSi P relaciona un par de elementos entonces se deduce como propiedad\n\nEs posible relacionar dos elementos I1 e I2 mediante una propiedad P que no ha sido declarada explícitamente como propiedad. Cuando esto ocurre, hay una regla de inferencia que deduce (implícitamente) la declaración de P como propiedad.\\text{<I1> <P> <I2>}\\quad \\Rightarrow \\quad \\text{<P> <rdf:type> <rdf:Property>}\n\nP2 relaciona todos los pares elementos de su subpropiedad P1\n\nSi P1 se declara subpropiedad de P2, entonces de todo par explícitamente relacionado por P1 se puede deducir que también lo está por P2\\left.\n \\begin{array}{c}\n   \\text{<P1> <rdf:subPropertyOf> <P2>} \\\\\n   \\text{<I1> <P1> <I2>}\n \\end{array}\n \\right\\rvert \\Rightarrow  \\text{<I1> <P2> <I2>}\n\nLa relación ‘ser subpropiedad de’ es transitiva\n\nSi P1 se declara subpropiedad de P2 y también P2 se declara subpropiedad de P3 entonces se puede deducir que P1 es subpropiedad de P3 (y, por tanto, todo par de elementos relacionados por P1 se pueden afirmar relacionado por P2).\\left.\n \\begin{array}{c}\n   \\text{<P1> <rdfs:subPropertyOf> <P2>} \\\\\n   \\text{<P2> <rdfs:subPropertyOf> <P3>}\n \\end{array}\n \\right\\rvert  \\Rightarrow  \\text{<P1> <rdfs:subPropertyOf> <P3>}\n\nDe las ternas (suj,P,obj), los sujetos pertenecen a la clase  dominio de P\n\nSi se ha declarado una clase C como dominio para la propiedad P, entonces de  todo par (I1,I2) relacionado por P se puede afirmar que I1 pertenece a la clase C.\\left.\n \\begin{array}{c}\n   \\text{<P> <rdfs:domain> <C>} \\\\\n   \\text{<I1> <P> <I2>}\n \\end{array}\n \\right\\rvert \\Rightarrow  \\text{<I1> <rdf:type> <C>}\n\nDe las ternas (suj,P,obj), los objetos pertenecen a la clase  rango de P\n\nSi se ha declarado una clase C como rango para la propiedad P, entonces de  todo par (I1,I2) relacionado por P se puede afirmar que I2 pertenece a la clase C.\\left.\n \\begin{array}{c}\n   \\text{<P> <rdfs:range> <C>} \\\\\n   \\text{<I1> <P> <I2>}\n \\end{array}\n \\right\\rvert \\Rightarrow  \\text{<I2> <rdf:type> <C>}","type":"content","url":"/rdf-vocabularios#expresividad-e-inferencia-rdfs","position":7},{"hierarchy":{"lvl1":"Cómo categorizar datos RDF","lvl3":"Actividad propuesta","lvl2":"Expresividad e inferencia RDFS"},"type":"lvl3","url":"/rdf-vocabularios#actividad-propuesta","position":8},{"hierarchy":{"lvl1":"Cómo categorizar datos RDF","lvl3":"Actividad propuesta","lvl2":"Expresividad e inferencia RDFS"},"content":"Objetivo. Se facilita un conjunto de tripletas (en formato Turtle) y se propone detectar las nuevas tripletas que se deducen a partir de ellas utilizando el servicio de inferencia en RDFShape.\n\nDatos de entrada. Los enunciados originales se pueden copiar del siguiente desplegable.\n\nDatos: ejemplo de enunciados sobre los que detectar tripletas inferidas\n\nSe parte de un documento RDF inicial con los enunciados que se muestran.PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX u: <http://datos.uned.es/ej/>\n\nu:Obra_narrativa rdf:type rdfs:Class .\nu:Obra_narrativa rdfs:subClassOf u:Obra_literaria .\nu:Obra_dramatica rdfs:subClassOf u:Obra_literaria .\n\nu:Escritor rdfs:subClassOf u:Persona .\n\nu:escrito_por rdfs:subPropertyOf u:creado_por .\nu:escrito_por rdfs:range u:Escritor .\nu:creado_por rdfs:domain u:Obra_artistica .\n\nu:Quijote u:escrito_por u:Cervantes ;\n          rdf:type u:Obra_narrativa .\nu:Yerma u:escrito_por u:Lorca ;\n        rdf:type u:Obra_dramatica .\n\n\nLas tripletas explícitamente incluidas en este conjunto de enunciados se representan en el siguiente diagrama.flowchart TD\n    ON[Obra_narrativa] -->|rdf:type| C[Class]\n    ON --> |rdfs:subClassOf| OL[Obra_literaria]\n    OD[Obra_dramática] -->|rdfs:subClass| OL\n    E[Escritor] -->|rdfs:subClassOf| P[Persona]\n    EP[\"* escrito_por\"] -->|rdfs:subPropertyOf| CP[creado_por]\n    EP -->|rdfs:domain| E\n    CP -->|rdfs:range| OA[Obra_artística]\n    Q(Quijote) -->|* escrito_por| CV(Cervantes)\n    Q -->|rdf:type| ON\n    Y(Yerma) -->|* escrito_por| LC(Lorca)\n    Y -->|rdf:type| OD\n\nSe puede observar que no se declaran explícitamente ni clases ni propiedades (salvo la clase Obra_narrativa). Estas declaraciones se deducirán de su uso como tales a partir de las reglas de inferencia. Sin embargo, es recomendable la declaración explícita inicial de todas las clases y propiedades para acotar la taxonomía (el vocabulario) RDFS donde se sitúan los datos que la pueblan.\n\nEjecución de la inferencia. Para aplicar la inferencia RDFS sobre el anterior conjunto de enunciados es preciso facilitarlos a una aplicación que (1) los reconozca sintácticamente, (2) aplique un razonador RDFS sobre ellos y (3) facilite el conjunto de enunciados ampliado tras la inferencia. Estas tareas se pueden realizar en el servicio RDFShape. Para ello se pueden seguir las siguientes instrucciones:\n\nCopiar \n\nlos datos de entrada facilitados anteriormente para esta actividad.\n\nPegarlos en RDFShape en su pestaña RDF::DataConvert:  \n\nhttps://​rdfshape​.weso​.es​/dataConvert\n\nMarcar como formato de entrada y de salida Turtle y ejecutar primero sin inferencia: se debe obtener como salida el mismo documento de la entrada.\n\nMarcar como formato de entrada y de salida Turtle y ejecutar con inferencia RDFS: se obtiene un documento muy ampliado, con las tripletas esperadas y otras que no se habían descrito.\n\nResultados del proceso de inferencia\n\nLa inferencia presenta las siguientes tripletas deducidas de los datos de entrada junto a otras muchas ternas. Estas ternas adicionales aparecerían igualmente aunque se cambiaran los datos iniciales y son inherentes al esquema RDFS: muestran la relación entre las etiquetas RDFS más técnicas (para modelado de estructuras a bajo nivel) que se han obviado. Como ejemplo de este tipo de relaciones, en RDFS todo término pertenece a la clase más general posible rdfs:Resource.\n\nSi se descartan estas tripletas generalistas, inherentes a RDFS, se obtienen las siguientes, que se presentan reordenadas para facilitar su lectura.@prefix rdf:  <http://www.w3.org/1999/02/22-rdf-syntax-ns#> .\n@prefix rdfs: <http://www.w3.org/2000/01/rdf-schema#> .\n@prefix u:    <http://datos.uned.es/ej/> .\n\n\nu:Obra_narrativa rdf:type dfs:Class , rdfs:Resource ;\n                 rdfs:subClassOf u:Obra_narrativa , u:Obra_literaria , rdfs:Resource .\n\nu:Obra_dramatica rdf:type rdfs:Class , rdfs:Resource ;\n                 rdfs:subClassOf  u:Obra_dramatica , u:Obra_literaria .\n\nu:Obra_literaria rdf:type rdfs:Class , rdfs:Resource ;\n                 rdfs:subClassOf  u:Obra_literaria .\n\nu:Obra_artistica rdf:type rdfs:Class , rdfs:Resource ;\n                 rdfs:subClassOf  u:Obra_artistica , rdfs:Resource .\n\nu:Escritor      rdf:type rdfs:Class , rdfs:Resource ;\n                rdfs:subClassOf  u:Escritor , u:Persona , rdfs:Resource .\n\nu:Persona       rdf:type rdfs:Class , rdfs:Resource ;\n                rdfs:subClassOf u:Persona .\n\n\n\nu:escrito_por   rdf:type rdf:Property , rdfs:Resource ;\n                rdfs:range u:Escritor ;\n                rdfs:subPropertyOf u:escrito_por , u:creado_por .\n\nu:creado_por    rdf:type rdf:Property , rdfs:Resource ;\n                rdfs:domain u:Obra_artistica ;\n                rdfs:subPropertyOf  u:creado_por .\n\n\n\nu:Quijote   rdf:type u:Obra_narrativa , u:Obra_literaria , u:Obra_artistica, rdfs:Resource ;\n            u:escrito_por  u:Cervantes ;\n            u:creado_por u:Cervantes .\n\nu:Cervantes rdf:type u:Escritor , u:Persona , rdfs:Resource  .\n\nu:Yerma     rdf:type u:Obra_dramatica , u:Obra_literaria , u:Obra_artistica , rdfs:Resource ;\n            u:escrito_por  u:Lorca ;\n            u:creado_por   u:Lorca .\n\nu:Lorca     rdf:type u:Escritor , u:Persona , rdfs:Resource  .\n\n\nEntre otras inferencias, se puede comprobar que el enunciado original Quijote escrito_por Cervantes permite inferir Quijote creado_por Cervantes porque la propiedad escrito_por era una subpropiedad de creado_por. Y esto último también conlleva que Quijote se deduzca como perteneciente a la clase Obra_artística porque es la clase rango de la propiedad creado_por.\n\nDe forma similar, de Quijote escrito_por Cervantes se deduce que Cervantes pertenece a la clase Escritor porque es la clase rango de la propiedad escrito_por. Y pertenece adicionalmente a la clase Persona porque Escritor se declaró como subclase de Persona.","type":"content","url":"/rdf-vocabularios#actividad-propuesta","position":9},{"hierarchy":{"lvl1":"Cómo categorizar datos RDF","lvl2":"Limitaciones de la inferencia RDFS"},"type":"lvl2","url":"/rdf-vocabularios#limitaciones-de-la-inferencia-rdfs","position":10},{"hierarchy":{"lvl1":"Cómo categorizar datos RDF","lvl2":"Limitaciones de la inferencia RDFS"},"content":"La expresividad que permite RDFS es muy limitada. Por ejemplo, no se puede declarar una clase como unión de otras dos previas o que dos clases son disjuntas (es decir, que no pueden tener elementos en común).\n\nEl estándar OWL 2 suplirá esta carencia de expresividad hasta donde es teóricamente posible y técnicamente realizable: facilita nuevas opciones de modelado de ontologías respaldadas por algoritmos que calculan consecuencias o que detectan insatisfacibilidad (cuando el modelado es inconsistente porque las restricciones de esa ontología no pueden cumplirse todas ellas a la vez).","type":"content","url":"/rdf-vocabularios#limitaciones-de-la-inferencia-rdfs","position":11},{"hierarchy":{"lvl1":"Agregación por categorías"},"type":"lvl1","url":"/select-nobel-agregaciones","position":0},{"hierarchy":{"lvl1":"Agregación por categorías"},"content":"El conjunto de resultados devuelto por los patrones de búsqueda se pueden partir en clases disjuntas. Esto permite ejecutar algunos cálculos sobre los elementos agregados de cada clase.","type":"content","url":"/select-nobel-agregaciones","position":1},{"hierarchy":{"lvl1":"Agregación por categorías","lvl2":"Cálculos sobre una categoría"},"type":"lvl2","url":"/select-nobel-agregaciones#c-lculos-sobre-una-categor-a","position":2},{"hierarchy":{"lvl1":"Agregación por categorías","lvl2":"Cálculos sobre una categoría"},"content":"La siguiente consulta mantiene todos los resultados en un misma clase y tan sólo devuelve un número: el recuento de los premiados que tenían menos de 50 años en la fecha de concesión de su premio Nobel. La función COUNT actúa sobre todas las instancias devueltas de la variable ?premiado y presenta su resultado en una variable nueva, como es ?numPremiado.\n\nConsulta: recuento de premiados menores de 50PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX nobel: <http://data.nobelprize.org/terms/>\nPREFIX dbp: <http://dbpedia.org/property/>\n\nSELECT (COUNT(DISTINCT ?premiado) AS ?numPremiado)\nWHERE {\n  ?premiado rdf:type nobel:Laureate .\n  ?premiado dbp:dateOfBirth ?fechaNac .\n  ?premiado nobel:laureateAward ?distinciónIndiv .\n  ?distinciónIndiv nobel:year ?añoNobel .\n  BIND ( (?añoNobel - year(?fechaNac)) AS ?edadNobel)\n  FILTER ( ?edadNobel < 50 )\n}\n\nPunto de consulta\n\nConsulta: edad promedio en la concesión del Nobel\n\nSi las instancias devueltas son números, se puede calcular su máximo, mínimo o promedio. Esta consulta devuelve la edad promedio que tenían los premiados Nobel en la fecha de su concesión.PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX nobel: <http://data.nobelprize.org/terms/>\nPREFIX dbp: <http://dbpedia.org/property/>\n\nSELECT (AVG(?edadNobel) AS ?edadNobelPromedio)\nWHERE {\n  ?premiado rdf:type nobel:Laureate .\n  ?premiado dbp:dateOfBirth ?fechaNac .\n  ?premiado nobel:laureateAward ?distinciónIndiv .\n  ?distinciónIndiv nobel:year ?añoNobel .\n  BIND ( (?añoNobel - year(?fechaNac)) AS ?edadNobel)\n}\n\nPunto de consulta","type":"content","url":"/select-nobel-agregaciones#c-lculos-sobre-una-categor-a","position":3},{"hierarchy":{"lvl1":"Agregación por categorías","lvl2":"Agrupación por categorías"},"type":"lvl2","url":"/select-nobel-agregaciones#agrupaci-n-por-categor-as","position":4},{"hierarchy":{"lvl1":"Agregación por categorías","lvl2":"Agrupación por categorías"},"content":"En la siguiente consulta, el patrón de búsqueda devuelve valores para las variables (?premioNobel, ?premiado, ?categoría). La instrucción GROUP BY produce una partición de estas instancias: pertenecen al mismo agrupamiento aquellas instancias que coincidan en tener el mismo valor para la variable escogida.\n\nDentro de cada agrupamiento, sobre los valores del resto de variables, se puede ejecutar un cálculo agregado. La siguiente consulta devuelve los diversos tipos de premios Nobel y, dentro de cada uno, el número de premiados.\n\nConsulta: recuento de premiados por cada una de las distintas categoríasPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX nobel: <http://data.nobelprize.org/terms/>\n\nSELECT ?categoría  (COUNT(DISTINCT ?premiado) AS ?numPremiadosCategoría)\nWHERE {\n  ?premioNobel rdf:type nobel:NobelPrize .\n  ?premioNobel nobel:laureate ?premiado .\n  ?premioNobel nobel:category ?categoría .\n}\nGROUP BY ?categoría \n\nPunto de consulta","type":"content","url":"/select-nobel-agregaciones#agrupaci-n-por-categor-as","position":5},{"hierarchy":{"lvl1":"Agregación por categorías","lvl2":"Categorías y subcategorías"},"type":"lvl2","url":"/select-nobel-agregaciones#categor-as-y-subcategor-as","position":6},{"hierarchy":{"lvl1":"Agregación por categorías","lvl2":"Categorías y subcategorías"},"content":"En la siguiente consulta, WHERE devuelve instancias para la n-tupla de variables (?premioNobel, ?categoría, ?premiado, ?género). Y GROUP BY especifica un agrupamiento entre las instancias con el mismo valor para ?categoría y, dentro de cada grupo, una nueva partición entre las instancias con el mismo valor para ?género.\n\nCada uno de estos grupos está compuesto por las distintas instancias (?premioNobel, ?categoría=X, ?premiado, ?género=Y), con X e Y fijas para cada grupo. Los cálculos sobre agregados se pueden realizar ahora dentro de cada grupo sobre los valores de (?premioNobel, ?premiado). La siguiente consulta devuelve los tipos de premios Nobel, diferenciando adicionalmente por género, y en cada apartado se añade su número de premiados.\n\nConsulta: recuento de premiados por categoría y genéroPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX nobel: <http://data.nobelprize.org/terms/>\nPREFIX foaf: <http://xmlns.com/foaf/0.1/>\n\nSELECT ?categoría ?género (COUNT(DISTINCT ?premiado) AS ?numPremiadosGrupo)\nWHERE {\n  ?premioNobel rdf:type nobel:NobelPrize .\n  ?premioNobel nobel:category ?categoría .\n  ?premioNobel nobel:laureate ?premiado .\n  ?premiado foaf:gender ?género .\n  \n}\nGROUP BY ?categoría ?género\nORDER BY ?categoría ?género\n\nPunto de consulta","type":"content","url":"/select-nobel-agregaciones#categor-as-y-subcategor-as","position":7},{"hierarchy":{"lvl1":"Agregación por categorías","lvl2":"Filtrado de categorías"},"type":"lvl2","url":"/select-nobel-agregaciones#filtrado-de-categor-as","position":8},{"hierarchy":{"lvl1":"Agregación por categorías","lvl2":"Filtrado de categorías"},"content":"Cuando se produce una partición mediante el uso de GROUP BY quizá no interese mantener el interés sobre todos los grupos detectados. Se puede aplicar a estos grupos el concepto de filtrado ya visto con anterioridad y descartar algunos grupos que no cumplen cierta condición. Sintácticamente, en este punto, se usa HAVING en vez de FILTER para mantener los grupos que cumplen la condición requerida.\n\nLa siguiente consulta agrupa por categoría y genéro, pero tan sólo mantiene aquellos grupos donde la edad mínima a la hora de recibir el premio era mayor de 36. (Es decir, quedan descartados los grupos en que algún premiado tenía menos o igual que 36 años al recibir el premio). De cada uno de estos grupos donde la condición se cumple adicionalmente se calcula en SELECT el recuento de sus premiados.\n\nConsulta: recuento de premiados por categoría y genéro sólo para ciertos gruposPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX nobel: <http://data.nobelprize.org/terms/>\nPREFIX foaf: <http://xmlns.com/foaf/0.1/>\nPREFIX dbp: <http://dbpedia.org/property/>\n\nSELECT ?categoría ?género (COUNT(DISTINCT ?premiado) AS ?numPremiadosGrupo)\nWHERE {\n  ?premioNobel rdf:type nobel:NobelPrize .\n  ?premioNobel nobel:category ?categoría .\n  ?premioNobel nobel:year ?añoNobel .\n  ?premioNobel nobel:laureate ?premiado .\n  ?premiado foaf:gender ?género .\n  ?premiado dbp:dateOfBirth ?fechaNacim .\n  BIND ((?añoNobel - YEAR(?fechaNacim)) AS ?edadPremiado) .\n}\nGROUP BY ?categoría ?género HAVING (MIN(?edadPremiado) > 36 )\nORDER BY ?categoría ?género\n\nSobre esta pregunta se sugiere ir variando el umbral de edad mínima de premiados y observar los grupos que aún cumplen la condicion.\n\nPunto de consulta","type":"content","url":"/select-nobel-agregaciones#filtrado-de-categor-as","position":9},{"hierarchy":{"lvl1":"Consultas exploratorias"},"type":"lvl1","url":"/select-nobel-exploratorias","position":0},{"hierarchy":{"lvl1":"Consultas exploratorias"},"content":"Cuando no se conoce la estructura de un repositorio RDF se puede tantear con  algunas consultas generales, aplicables a cualquier dataset RDF, que proporcionan información estructural.","type":"content","url":"/select-nobel-exploratorias","position":1},{"hierarchy":{"lvl1":"Consultas exploratorias","lvl2":"Individuos, clases y propiedades"},"type":"lvl2","url":"/select-nobel-exploratorias#individuos-clases-y-propiedades","position":2},{"hierarchy":{"lvl1":"Consultas exploratorias","lvl2":"Individuos, clases y propiedades"},"content":"La primera consulta detecta todas las clases utilizadas en el repositorio. La segunda, todas las propiedades utilizadas. Aprovechando esta información, se presenta una consulta que demanda todos los elementos de una de las clases detectadas.","type":"content","url":"/select-nobel-exploratorias#individuos-clases-y-propiedades","position":3},{"hierarchy":{"lvl1":"Consultas exploratorias","lvl3":"Detección de todas las clases","lvl2":"Individuos, clases y propiedades"},"type":"lvl3","url":"/select-nobel-exploratorias#detecci-n-de-todas-las-clases","position":4},{"hierarchy":{"lvl1":"Consultas exploratorias","lvl3":"Detección de todas las clases","lvl2":"Individuos, clases y propiedades"},"content":"La siguiente consulta devuelve todas las clases del repositorio. Se puede copiar, pegar y ejecutar en la página \n\nhttps://​data​.nobelprize​.org​/sparql.\n\nConsulta: todas las clases del datasetPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n\nSELECT DISTINCT ?clase         #resultado requerido\nWHERE {\n  ?elemento rdf:type ?clase    #patrón de búsqueda\n}\n\nEstructura de la consulta\n\nPatrón de búsqueda. El patrón de búsqueda se sitúa en el cuerpo de WHERE. En este caso consta de una única tripleta. El literal que sigue al signo # es un comentario opcional no ejecutable. En la tripleta de búsqueda hay dos variables. Cada una de ellas comienza por ? y se les puede asignar el nombre que se desee.\n\nVariables y concordancias detectadas. Este patrón recorre todos los enunciados del dataset y detecta los que son del tipo “algo1 rdf:type algo2”. Si se aplicara sobre los enunciados de la siguiente tabla izquierda se detectaría concordancia en tres de ellos. Estas concordancias se van almacenando en una tabla interna (?elemento, ?clase) como la que se muestra a la derecha.\\begin{array}{c}\n\\text{tripletas en el dataset} \\\\ \\hline\n<sujetoA> <rdf:type> <clase1> \\\\\n<sujetoB><(otro\\ predicado)><objetoK>\\\\\n<sujetoC><rdf:type><clase2> \\\\\n<sujetoD><rdf:type><clase1> \n\\end{array}\\quad \\Rightarrow \n\\begin{array}{cc}\n?elemento  & ?clase \\\\ \\hline\nsujetoA &  clase1 \\\\\n &   \\\\\nsujetoC & clase2 \\\\\nsujetoD & clase1 \n\\end{array}\n\nResultado final deseado. En SELECT se expresa qué resultados se desea construir a partir de la tabla interna anterior. En este caso, sólo interesan los valores detectados en la columna ?clase de esa tabla interna. Y además interesan sin repeticiones (DISTINCT). Es decir, a partir de la tabla interna de la explicación anterior se produciría como resultado de SELECT:\\begin{array}{c}\n?clase \\\\ \\hline\nclase1 \\\\\nclase2 \\\\\n\\end{array}\n\nResultados\n\nEl punto de consulta de la Fundación Nobel devuelve una relación completa de sus clases. Tres de ellas son propias. Corresponden a las categorías escogidas para estructurar su información específica.\n\n<http://data.nobelprize.org/terms/Laureate>\n\n<http://data.nobelprize.org/terms/LaureateAward>\n\n<http://data.nobelprize.org/terms/NobelPrize>\n\nAparte de estas tres clases, este repositorio ‘toma prestados’ identificadores de clases de otras entidades. En particular, va a utilizar los identificadores (y exactamente la misma semántica) que utiliza \n\ndbpedia.org para designar los siguientes conceptos Award, Country, City y University.\n\nDel estándar \n\nfoaf (Friend of a friend) utiliza sus identificadores para Person, Organization y Agent.","type":"content","url":"/select-nobel-exploratorias#detecci-n-de-todas-las-clases","position":5},{"hierarchy":{"lvl1":"Consultas exploratorias","lvl3":"Detección de las propiedades","lvl2":"Individuos, clases y propiedades"},"type":"lvl3","url":"/select-nobel-exploratorias#detecci-n-de-las-propiedades","position":6},{"hierarchy":{"lvl1":"Consultas exploratorias","lvl3":"Detección de las propiedades","lvl2":"Individuos, clases y propiedades"},"content":"La siguiente consulta demanda todas las propiedades del dataset. Se puede copiar, pegar y ejecutar en la página \n\nhttps://​data​.nobelprize​.org​/sparql.\n\nConsulta: todas las propiedades del dataset# No se especifican prefijos porque no se usan en la consulta\n\nSELECT DISTINCT ?propiedad\nWHERE {\n  ?sujeto ?propiedad ?objeto\n}\n\nEstructura de la consulta\n\nEl patrón de búsqueda (en WHERE) concuerda con todos y cada uno de los enunciados del dataset porque es del tipo: “algo1 con_alguna_relación_con algo2”. De esta forma, cuando el patrón recorre los enunciados del dataset va incorporando cada uno de ellos a la tabla interna de concordancias.\n\nEsta tabla de concordancias consta de tres columnas (?sujeto, ?propiedad, ?objeto) y tiene en sus filas todos los enunciados del dataset (porque todos concuerdan con el patrón).\n\nEn SELECT se especifica que tan sólo se quieren resultados de la columna ?propiedad de esa tabla interna generada. Y además, se solicita (mediante DISTINCT) que se evite mencionar repetidamente una propiedad aunque aparezca en varias filas de la tabla.\n\nEl resultado final es la relación de todas las propiedades del dataset: no porque hayan sido declaradas explícitamente como tales sino porque son términos que aparecen en segundo lugar en los enunciados.\n\nResultados\n\nSe obtiene una relación de más de cincuenta propiedades utilizadas internamente. Las propiedades propias, que la Fundación Nobel ha considerado que debía usar, con su semántica específica, son:\n\n<http://data.nobelprize.org/terms/laureate>\n\n<http://data.nobelprize.org/terms/laureateAward>\n\n<http://data.nobelprize.org/terms/nobelPrize>\n\n<http://data.nobelprize.org/terms/share>\n\n<http://data.nobelprize.org/terms/sortOrder>\n\n<http://data.nobelprize.org/terms/motivation>\n\n<http://data.nobelprize.org/terms/year>\n\n<http://data.nobelprize.org/terms/category>\n\n<http://data.nobelprize.org/terms/categoryOrder>\n\n<http://data.nobelprize.org/terms/university>\n\nAdicionalmente hay otras propiedades definidas por otras instituciones que discrecionalmente se usan en este dataset porque están siendo usadas tal cual en muchos otros repositorios públicos.","type":"content","url":"/select-nobel-exploratorias#detecci-n-de-las-propiedades","position":7},{"hierarchy":{"lvl1":"Consultas exploratorias","lvl3":"Todos los individuos de una clase","lvl2":"Individuos, clases y propiedades"},"type":"lvl3","url":"/select-nobel-exploratorias#todos-los-individuos-de-una-clase","position":8},{"hierarchy":{"lvl1":"Consultas exploratorias","lvl3":"Todos los individuos de una clase","lvl2":"Individuos, clases y propiedades"},"content":"Se detectó que una de las clases del vocabulario era NobelPrize. La siguiente consulta obtiene la enumeración completa de todos los elementos de esa clase. De nuevo, se puede copiar, pegar y ejecutar en \n\nhttps://​data​.nobelprize​.org​/sparql.\n\nConsulta: todos los elementos de la clase NobelPrizePREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX nobel: <http://data.nobelprize.org/terms/>\n\nSELECT ?premioNobel\nWHERE {\n  ?premioNobel rdf:type nobel:NobelPrize\n}\nORDER BY ?premioNobel\nLIMIT 100000\n\nEstructura de la consulta\n\nEl patrón de consulta es “algo pertenece_a clase_NobelPrize”. Concuerda con en cada caso en que un elemento concreto es sujeto de un enunciado así y almacena internamente cada uno de esos elementos en una tabla interna con una única columna (?premioNobel).\n\nFuera del patrón de búsqueda (fuera de WHERE) se solicita que esa tabla interna de concordancias presente ordenadas sus filas por la columna (?premioNobel), que coincide aquí en ser la única columna. Y además, que a lo sumo acumule 100000 concordancias, es decir, que pare la búsqueda cuando llegue a ese límite.\n\nEl uso de LIMIT es una buena práctica porque algunas consultas en ciertos repositorios pueden retornar millones de resultados y el servidor puede interrumpir la ejecuciónde nuestra consulta por exceso de tiempo consumido.\n\nSolicitar tan sólo el número de resultados. Como opción alternativa, se puede solicitar tan sólo el número de resultados. En la siguiente consulta lo que se almacena internamente es un contador de concordancias de la variable ?premioNobel como sujeto de ese patrón. Y en SELECT se solicita su suma y el almacenamiento del resultado en la variable ?premioNobelNum, que es el resultado final de la consulta.PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX nobel: <http://data.nobelprize.org/terms/>\n\nSELECT (COUNT(?premioNobel) AS ?premioNobelNum)\nWHERE {?premioNobel rdf:type nobel:NobelPrize}\n\nResultados\n\nCuando se pregunta por los elementos que pertenecen a la clase NobelPrize se obtiene más de mil docientos identificadores de eso elementos similares al siguiente:\n\n<http://data.nobelprize.org/resource/nobelprize/Chemistry/1901>\n\nCada año se concede un único premio Nobel por cada categoría, que puede recaer de forma compartida en uno o más premiados (hasta un total de 3) que pueden ser personas o instituciones.","type":"content","url":"/select-nobel-exploratorias#todos-los-individuos-de-una-clase","position":9},{"hierarchy":{"lvl1":"Consultas exploratorias","lvl3":"Descarga de todos los enunciados","lvl2":"Individuos, clases y propiedades"},"type":"lvl3","url":"/select-nobel-exploratorias#descarga-de-todos-los-enunciados","position":10},{"hierarchy":{"lvl1":"Consultas exploratorias","lvl3":"Descarga de todos los enunciados","lvl2":"Individuos, clases y propiedades"},"content":"No es lo habitual en los dataset públicos, pero el conjunto de datos de este repositorio es suficientemente pequeño como para plantearse recuperarlo en su totalidad. Como medida de precaución la consulta se autoimpone un límite, que se puede ir ampliando.\n\nConsulta: todos los enunciados del dataset consultadoSELECT DISTINCT ?sujeto ?propiedad ?objeto\nWHERE { ?sujeto ?propiedad ?objeto }\nORDER BY ?propiedad\nLIMIT 300000\n\nEstructura de la consulta\n\nEsta consulta tiene el mismo patrón de búsqueda que la realizada \n\npara extraer todas las propiedades: “algo1 tiene_alguna_relación_con algo2”. En ambas consultas la tabla interna de concordancias almacena cada enunciado del dataset debajo de las columnas (?sujeto, ?predicado, ?objeto). Pero en la consulta sobre propiedades se pedía sólo la columna intermedia sin repeticiones y en esta consulta se piden las 3 columnas (es decir, el enunciado completo).\n\nResultados\n\nCuando se ejecuta, el sistema muestra más de cuarenta y siete mil filas (?sujeto, ?predicado, ?objeto), correspondientes a los enunciados del dataset.\n\nSobre la descarga de todos los enunciados en Nobelprizes\n\nEl punto de consulta de la Fundación Nobel permite descargar la tabla de resultados devueltos para cualquier consulta. Se recomienda descargar los resultados de la consulta anterior.\n\nEsta tabla de resultados concreta no es estructuralmente un volcado de la base de datos: no está expresada en un formato RDF y no se puede importar tal cual en un gestor de ternas RDF. En general, las consultas SELECT no retornan un conjunto de tripletas RDF sino una ‘tabla de filas con N columnas’. En concreto, cada fila consta de los N valores de cada concordancia del patrón para las variables (?var1, ..., ?varN) solicitadas en SELECT.\n\nNo obstante, si esta descarga se produce en formato CSV y se abre este fichero se observan resultados como los siguientes:\"sujeto\",\"propiedad\",\"objeto\"\n\"http://data.nobelprize.org/resource/laureateaward/Chemistry/1901/160\",\"http://data.nobelprize.org/terms/category\",\"http://data.nobelprize.org/resource/category/Chemistry\"\n\"http://data.nobelprize.org/resource/laureateaward/Chemistry/1902/161\",\"http://data.nobelprize.org/terms/category\",\"http://data.nobelprize.org/resource/category/Chemistry\"\n...\n\nEs fácil programar un script Python (o solicitarlo a ChatGPT o servicio similar) para convertir cada línea del CSV en un enunciado RDF correctamente expresado en formato N-Triples.\n\nY este fichero (o su conversión a cualquier formato RDF) sí es consultable localmente en SPARQL desde Python o tras su importación en una base de datos local como GraphDB Desktop.","type":"content","url":"/select-nobel-exploratorias#descarga-de-todos-los-enunciados","position":11},{"hierarchy":{"lvl1":"FILTER, BIND y funciones"},"type":"lvl1","url":"/select-nobel-filtrado-ligado","position":0},{"hierarchy":{"lvl1":"FILTER, BIND y funciones"},"content":"","type":"content","url":"/select-nobel-filtrado-ligado","position":1},{"hierarchy":{"lvl1":"FILTER, BIND y funciones","lvl2":"FILTER"},"type":"lvl2","url":"/select-nobel-filtrado-ligado#filter","position":2},{"hierarchy":{"lvl1":"FILTER, BIND y funciones","lvl2":"FILTER"},"content":"","type":"content","url":"/select-nobel-filtrado-ligado#filter","position":3},{"hierarchy":{"lvl1":"FILTER, BIND y funciones","lvl3":"Efecto del filtrado","lvl2":"FILTER"},"type":"lvl3","url":"/select-nobel-filtrado-ligado#efecto-del-filtrado","position":4},{"hierarchy":{"lvl1":"FILTER, BIND y funciones","lvl3":"Efecto del filtrado","lvl2":"FILTER"},"content":"La siguiente consulta solicita ‘reconocimiento, año y nombre de premiado’ pero sólo de los concedidos posteriormente a 1970. Esta tarea no se puede resolver con el uso descrito para MINUS:\n\nCon MINUS se podrían descartar de los resultados del patrón {#1,#2,#3} aquellos premiados para los que exista año de concesión\n\nPero no es eso lo que se pretende: interesa entrar dentro del valor del año y mantener sólo los resultados con valor de año superior a 1970.\n\nPara ello se requiere FILTER, para dejar pasar tan sólo los resultados cuyos valores cumplen una determinada condición.\n\nConsulta: tan sólo los resultados con año posterior a 1970PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX nobel: <http://data.nobelprize.org/terms/>\n\nSELECT DISTINCT ?reconocimiento ?año ?premiado \nWHERE {\n    ?reconocimiento rdf:type nobel:LaureateAward .          #1\n    ?reconocimiento nobel:year ?año .                       #2\n    ?reconocimiento nobel:laureate ?premiado .              #3 \n    FILTER(?año > 1970)\n}\nORDER BY ?año\n\nSe sugiere copiar esta pregunta y comentar el filtrado (es decir, anteponer # a la línea de FILTER para que no se ejecute). Cuando se ejecuta en \n\nhttps://​data​.nobelprize​.org​/sparql se obtienen los resultados del patrón {#1,#2,#3} sin filtrar, de cualquier año. Si se descomenta FILTER y se ejecuta, tan sólo aparecen valores superior a 1970.","type":"content","url":"/select-nobel-filtrado-ligado#efecto-del-filtrado","position":5},{"hierarchy":{"lvl1":"FILTER, BIND y funciones","lvl3":"Ámbito del filtrado","lvl2":"FILTER"},"type":"lvl3","url":"/select-nobel-filtrado-ligado#id-mbito-del-filtrado","position":6},{"hierarchy":{"lvl1":"FILTER, BIND y funciones","lvl3":"Ámbito del filtrado","lvl2":"FILTER"},"content":"FILTER ejecuta el filtrado requerido en el ámbito del grupo de enunciados en que se encuentra. La siguiente consulta considera dos grupos, {#1,#2,#3} y {#4,#5}, como patrones de búsqueda. Sobre los resultados intermedios del grupo1 se aplica un determinado FILTER. Y sobre los resultados intermedios del grupo2 se aplica independientemente otro filtrado. Y posteriormente se componen ambos grupos de respuestas mediante MINUS.\n\nConsulta: dos filtros, cada uno en su ámbito de ejecuciónPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX nobel: <http://data.nobelprize.org/terms/>\nPREFIX foaf: <http://xmlns.com/foaf/0.1/>\nPREFIX dbp: <http://dbpedia.org/property/>\n\nSELECT DISTINCT ?reconocimiento ?año ?premiado \nWHERE {\n  { ?reconocimiento rdf:type nobel:LaureateAward .          #1\n    ?reconocimiento nobel:year ?año .                       #2\n    ?reconocimiento nobel:laureate ?premiado .              #3 \n    FILTER(?año > 1970) }\n  MINUS \n  { ?premiado dbp:dateOfDeath ?fechaFallec .                #4\n    ?premiado foaf:gender ?género .                         #5\n    FILTER(?género = \"male\") }\n}\nORDER BY ?año\n\nCuando se ejecuta en \n\nhttps://​data​.nobelprize​.org​/sparql se obtiene el siguente resultado: (A) por un lado, los resultados (?reconocimiento, ?año, ?premiado) con año mayor que 1970; (B) por otro lado (?premiado, ?genero) siempre que el género sea masculino. Finalmente (A-B) se descartan de los premiados en (A) aquéllos que también aparecen en (B):\n\nEn resumen, se solicita “los (?reconocimiento,?año,?premiado) a partir de 1970 salvo los premiados que cumplan tener fecha de fallecimiento y género masculino”. Aparecen más de trescientos resultados que pueden ser de género femenino (fallecidas o no) o de género masculino no fallecidos.","type":"content","url":"/select-nobel-filtrado-ligado#id-mbito-del-filtrado","position":7},{"hierarchy":{"lvl1":"FILTER, BIND y funciones","lvl3":"Condiciones compuestas","lvl2":"FILTER"},"type":"lvl3","url":"/select-nobel-filtrado-ligado#condiciones-compuestas","position":8},{"hierarchy":{"lvl1":"FILTER, BIND y funciones","lvl3":"Condiciones compuestas","lvl2":"FILTER"},"content":"La siguiente consulta consta de un único grupo de enunciados y por tanto se pueden omitir las llaves que lo enmarcan. Hay un filtro aplicado sobre sus instancias. Un filtro puede estar situado en cualquier posición entre los enunciados de su grupo: su ejecución siempre se producirá al final de la búsqueda del grupo, para mantener las instancias que cumplan la condición. La condición puede ser compuesta a partir de conjunciones (&&), disyunciones (||) o negaciones (!).\n\nConsulta: filtro con una condición compuesta (conjuntiva)PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX nobel: <http://data.nobelprize.org/terms/>\nPREFIX foaf: <http://xmlns.com/foaf/0.1/>\n\nSELECT DISTINCT ?reconocimiento ?año ?premiado ?género\nWHERE {\n    ?reconocimiento rdf:type nobel:LaureateAward .          #1\n    ?reconocimiento nobel:year ?año .                       #2\n    FILTER(?año > 1970 && ?género=\"female\")\n    ?reconocimiento nobel:laureate ?premiado .              #3\n    ?premiado foaf:gender ?género .                         #4\n}\nORDER BY ?año ?premiado","type":"content","url":"/select-nobel-filtrado-ligado#condiciones-compuestas","position":9},{"hierarchy":{"lvl1":"FILTER, BIND y funciones","lvl3":"Funciones","lvl2":"FILTER"},"type":"lvl3","url":"/select-nobel-filtrado-ligado#funciones","position":10},{"hierarchy":{"lvl1":"FILTER, BIND y funciones","lvl3":"Funciones","lvl2":"FILTER"},"content":"SPARQL facilita funciones sobre términos RDF. Su resultado se puede utilizar en la composición de condiciones en filtros, como por ejemplo en:\n\nFILTER ( LANG(?variable) = “en” ): el literal almacenado en ?variable debe ser del tipo xxxx@en, es decir, declarado como literal en inglés.\n\nFILTER ( (YEAR(NOW()) - YEAR(?variable)) > 20 ): el año almacenado en ?variable está a más de veinte años del actual.\n\nFILTER ( STRSTARTS(?variable) = “Priz” ): el literal almacenado en ?variable comienza por los caracteres “Priz”.\n\nAdicionalmente, FILTER (NOT) EXISTS se aplica sobre grupos de enunciados, como en el siguiente ejemplo\n\nConsulta: uso de funciones en las condiciones de los filtrosPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX nobel: <http://data.nobelprize.org/terms/>\n\nSELECT DISTINCT ?reconocimiento ?motivación\nWHERE {\n  ?reconocimiento rdf:type nobel:LaureateAward .\n  ?reconocimiento nobel:motivation ?motivación .\n  FILTER( LANG(?motivación) = \"en\" )\n  FILTER NOT EXISTS {?reconocimiento nobel:university ?universidad}\n}\nORDER BY ?reconocimiento\n\nEsta consulta devuelve cada reconocimiento junto al literal de su motivación (en su versión en inglés), siempre que ese reconocimiento no esté asociado a una universidad (es decir que se cumpla que no existe una terna asocia ese reconocimiento a una universidad.\n\nSe puede ejecutar esta consulta en \n\nhttps://​data​.nobelprize​.org​/sparql comentando (es decir, ‘desconectando’) los dos filtros o sólo uno de ellos o ninguno.","type":"content","url":"/select-nobel-filtrado-ligado#funciones","position":11},{"hierarchy":{"lvl1":"FILTER, BIND y funciones","lvl2":"BIND"},"type":"lvl2","url":"/select-nobel-filtrado-ligado#bind","position":12},{"hierarchy":{"lvl1":"FILTER, BIND y funciones","lvl2":"BIND"},"content":"BIND(valor AS ?variable) liga ese ‘valor’ concreto como valor fijo de la ?variable, para toda búsqueda de instancias de ese patrón. En la siguiente consulta se usa para mostrar en la variable ?edadPremiado la edad que tenía el premiado cuando se le asignó el premio Nobel.\n\nBIND ( (?añoNobel - YEAR(?fechaNac)) AS ?edadPremiado ) calcula primero la diferencia entre el año de concesión (?añoNobel) y el año extraído de la fecha de nacimiento, y esta edad calculada del premiado en la fecha de concesión se almacena en la variable ?edadPremiado.\n\nConsulta: asignación de un valor a un varible en WHERE mediante BINDPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX nobel: <http://data.nobelprize.org/terms/>\nPREFIX dbp: <http://dbpedia.org/property/>\nPREFIX foaf: <http://xmlns.com/foaf/0.1/>\n\nSELECT DISTINCT ?premiado ?nombre ?fechaNac  ?añoNobel ?edadPremiado\nWHERE {\n  ?premiado rdf:type nobel:Laureate .\n  ?premiado dbp:dateOfBirth ?fechaNac .\n  ?premiado foaf:name ?nombre .\n  ?premiado nobel:laureateAward ?reconocimiento .\n  ?distinciónIndiv nobel:year ?añoNobel .\n  BIND ( (?añoNobel - YEAR(?fechaNac)) AS ?edadPremiado )\n}\nORDER BY ?añoNobel\n\nSe recomienda ejecutar esta consulta en \n\nhttps://​data​.nobelprize​.org​/sparql para analizar los resultados.\n\nEl mismo resultado Se puede obtener asignando ese cálculo de edad directamente a la variable ?edadPremiado en SELECT, donde no se utiliza sintácticamente BIND.\n\nConsulta: asignación de un valor a un varible en SELECTPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX nobel: <http://data.nobelprize.org/terms/>\nPREFIX dbp: <http://dbpedia.org/property/>\nPREFIX foaf: <http://xmlns.com/foaf/0.1/>\n\nSELECT DISTINCT ?premiado ?nombre ?fechaNac  ?añoNobel ((?añoNobel - YEAR(?fechaNac)) AS ?edadPremiado )\nWHERE {\n  ?premiado rdf:type nobel:Laureate .\n  ?premiado dbp:dateOfBirth ?fechaNac .\n  ?premiado foaf:name ?nombre .\n  ?premiado nobel:laureateAward ?distinciónIndiv .\n  ?distinciónIndiv nobel:year ?añoNobel .\n}\nORDER BY ?añoNobel\n\nComo en el resto de propuestas, se recomienda ejecutar esta consulta en \n\nhttps://​data​.nobelprize​.org​/sparql e incluso experimentar con modificaciones de la misma.","type":"content","url":"/select-nobel-filtrado-ligado#bind","position":13},{"hierarchy":{"lvl1":"Composición de patrones"},"type":"lvl1","url":"/select-nobel-grupos-patrones","position":0},{"hierarchy":{"lvl1":"Composición de patrones"},"content":"","type":"content","url":"/select-nobel-grupos-patrones","position":1},{"hierarchy":{"lvl1":"Composición de patrones","lvl2":"Un único patrón"},"type":"lvl2","url":"/select-nobel-grupos-patrones#un-nico-patr-n","position":2},{"hierarchy":{"lvl1":"Composición de patrones","lvl2":"Un único patrón"},"content":"El patrón de búsqueda puede constar de tantos enunciados como se requiera y entre estos enunciados aparecen variables (?var1, ..., ?varn). La siguiente consulta utiliza un patrón de búsqueda con tres enunciados entre los que aparecen tres variables.\n\nConsulta: Premiados, con su Premio y año de concesiónPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX nobel: <http://data.nobelprize.org/terms/>\n\nSELECT DISTINCT ?premiado ?suPremio ?año\nWHERE {\n    ?premiado rdf:type nobel:Laureate .        #1\n    ?premiado nobel:nobelPrize ?suPremio .     #2\n    ?suPremio nobel:year ?año .                #3\n}\nORDER BY ?año\n\nEstructura de la consulta\n\nSi en el grafo del dataset se encontraran los nodos siguientes, el patrón de la consulta marcaría una ocurrencia para los valores (?premiado = premiado32, ?suPremio = premioNobel43,?año = “1982”). Y esta fila de resultados (premiado32, premioNobel43, “1983”) se añadiría a la tabla interna de concordancias, con columnas (?premiado, ?suPremio, ?año).flowchart LR\n    P32(premiado32) --> |type| L[Laureate]\n    P32 --> |nobelPrize| P43(premioNobel43)\n    P43 --> |year| A[[1982]]\n\nResultados. La ejecución de esta consulta en \n\nhttps://​data​.nobelprize​.org​/sparql ofrece mil filas de concordancias.\n\nLa siguiente consulta añade una nueva restricción: los premiados, adicionalmente, deben ser de género femenino. Y sólo se admite una concordancia cuando ocurre en todos los enunciados. Es decir, los premiados con género masculino y aquéllos cuyo género no esté registrado no producen una fila de resultados en la tabla interna de concordancias.\n\nConsulta: Premiados, con su Premio y año de concesión, siempre que su género sea femeninoPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX nobel: <http://data.nobelprize.org/terms/>\nPREFIX foaf: <http://xmlns.com/foaf/0.1/>\n\nSELECT DISTINCT ?premiado ?suPremioNobel ?año\nWHERE {\n    ?premiado rdf:type nobel:Laureate .                                          #1\n    ?premiado nobel:nobelPrize ?suPremioNobel .                                  #2\n    ?suPremioNobel nobel:year ?año .                                             #3\n    ?premiado foaf:gender \"female\" .                                             #4\n}\nORDER BY ?año\n\nResultados. La ejecución de esta consulta en \n\nhttps://​data​.nobelprize​.org​/sparql se reduce ahora a poco más de sesenta filas de concordancias.","type":"content","url":"/select-nobel-grupos-patrones#un-nico-patr-n","position":3},{"hierarchy":{"lvl1":"Composición de patrones","lvl2":"Grupos de patrones"},"type":"lvl2","url":"/select-nobel-grupos-patrones#grupos-de-patrones","position":4},{"hierarchy":{"lvl1":"Composición de patrones","lvl2":"Grupos de patrones"},"content":"Los enunciados en WHERE se pueden agrupar en bloques, rodeados sintácticamente por llaves. Si se acota más de un bloque, como por ejemplo {#1, #2, #3} {#4}, cada bloque actúa como un patrón de búsqueda independiente y produce resultados intermedios de ese bloque. Para calcular la respuesta final hay que precisar cómo combinar estos resultados intermedios.","type":"content","url":"/select-nobel-grupos-patrones#grupos-de-patrones","position":5},{"hierarchy":{"lvl1":"Composición de patrones","lvl3":"UNION","lvl2":"Grupos de patrones"},"type":"lvl3","url":"/select-nobel-grupos-patrones#union","position":6},{"hierarchy":{"lvl1":"Composición de patrones","lvl3":"UNION","lvl2":"Grupos de patrones"},"content":"Una forma de combinar esos resultados es mediante la unión de los mismos. La siguiente consulta ejecuta esa unión.\n\nConsulta: primer ejemplo de unión de resultados intermediosPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX nobel: <http://data.nobelprize.org/terms/>\nPREFIX foaf: <http://xmlns.com/foaf/0.1/>\n\nSELECT DISTINCT ?premiado ?suPremioNobel ?año\nWHERE {\n  { ?premiado rdf:type nobel:Laureate .\n    ?premiado nobel:nobelPrize ?suPremioNobel .\n    ?suPremioNobel nobel:year ?año . }            # Grupo1\n  UNION\n  {  ?premiado foaf:gender \"female\" . }           # Grupo2\n}\nORDER BY ?premiado\n\nEstructura de la consulta y resultados\n\nEl primer patrón de búsqueda genera una tabla interna de concordancias con tres columnas (?premiado, ?suPremioNobel, ?año) y más de mil filas. El segundo patrón genera una tabla interna con una única columna (?premiado) y unas sesenta filas. Se solicita presentar la unión de estos resultados intermedios. Las filas del segundo patrón (sólo con resultado en la columna ?premiado) se pueden añadir directamente a la tabla del primero. Esto produce una tabla final como la siguiente:\\begin{array}{ccc}\n?premiado & ?suPremioNobel & \\text{?año} \\\\ \\hline\npremiado3 & Medicina & 1973 \\\\\npremiado5 & & \\\\\npremiado22 & \\text{Física} & 1982 \\\\\n... & ... & ... \\\\\n\\end{array}\n\nSe puede ejecutar la pregunta en \n\nhttps://​data​.nobelprize​.org​/sparql y se observa cómo hay filas sólo con valores en esa primera columna, que proceden del segundo patrón de consulta.\n\nPara resaltar la independencia de ambos patrones de búsqueda se recomienda ejecutar la siguiente consulta. Difiere de la anterior en que el segundo patrón almacena sus premiados en una variable distinta de la utilizada en el primer patrón.\n\nConsulta: segundo ejemplo de unión de resultados intermediosPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX nobel: <http://data.nobelprize.org/terms/>\nPREFIX foaf: <http://xmlns.com/foaf/0.1/>\n\nSELECT DISTINCT ?premiado ?premiadoFem ?suPremioNobel ?año\nWHERE {\n  { ?premiado rdf:type nobel:Laureate .\n    ?premiado nobel:nobelPrize ?suPremioNobel .\n    ?suPremioNobel nobel:year ?año . }                # Grupo1\n  UNION\n  { ?premiadoFem foaf:gender \"female\" . \n    ?premiadoFem nobel:nobelPrize ?suPremioNobel . }  # Grupo2\n}\nORDER BY ?suPremioNobel\n\nEstructura de la consulta y resultados\n\nEn este caso, los resultados intermedios producidos por el segundo patrón no se pueden agregar directamente sobre la tabla del primer patrón porque falta la columna ?premiadoFem. La tabla final resultante añade esa columa y tendría la siguiente estructura.\\begin{array}{cccc}\n?premiado & premiadoFem&  ?suPremioNobel & \\text{?a\\~no} \\\\ \\hline\npremiado3 & & Medicina & 1973 \\\\\n  & premiado5 &  \\text{Química} & \\\\\npremiado22 & & \\text{Física} & 1982 \\\\\n... & ... & ... & ...\\\\\n\\end{array}\n\nSe puede ejecutar la consulta en \n\nhttps://​data​.nobelprize​.org​/sparql y comprobar esta composición de resultados.","type":"content","url":"/select-nobel-grupos-patrones#union","position":7},{"hierarchy":{"lvl1":"Composición de patrones","lvl3":"(Intersección)","lvl2":"Grupos de patrones"},"type":"lvl3","url":"/select-nobel-grupos-patrones#id-intersecci-n","position":8},{"hierarchy":{"lvl1":"Composición de patrones","lvl3":"(Intersección)","lvl2":"Grupos de patrones"},"content":"Dados dos grupos, como en {#1, #2, #3} y {#4, #5}, se puede requerir como resultado final su interseccion; es decir, que sólo se muestren los resultados que aparecen por igual en ambos grupos. Sintácticamente esto se expresa simplemente escribiendo un grupo tras otro: {#1, #2, #3} {#4, #5}, pero esto es equivalente a requerir resultados de un único grupo con esos 5 enunciados como patrón {#1, #2, #3, #4, #5}.","type":"content","url":"/select-nobel-grupos-patrones#id-intersecci-n","position":9},{"hierarchy":{"lvl1":"Composición de patrones","lvl3":"OPTIONAL","lvl2":"Grupos de patrones"},"type":"lvl3","url":"/select-nobel-grupos-patrones#optional","position":10},{"hierarchy":{"lvl1":"Composición de patrones","lvl3":"OPTIONAL","lvl2":"Grupos de patrones"},"content":"Hay premiados por la Fundación Nobel que no han fallecido (y por tanto, no tienen registrada una fecha de fallecimiento). También hay premiados que no tienen registrada afiliación a una universidad.\n\nConsultas: tres ejemplos diferenciados del uso de OPTIONAL\n\nEsos resultados (con datos incompletos) no aparecen como respuesta a la siguiente consulta, como se puede comprobar.\n\nNo van a aparecer filas en la tabla final sólo con valores en ?premiado y ?nombre y celda vacía en ?fechaFallec o en ?afiliación.\n\nPara que una concordancia se añada a la tabla de resultados debe facilitar valores para esas 4 variables de forma que el patrón coincida en ese punto con el grafo de datos.PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX nobel: <http://data.nobelprize.org/terms/>\nPREFIX foaf: <http://xmlns.com/foaf/0.1/>\nPREFIX dbp: <http://dbpedia.org/property/>\nPREFIX dbo: <http://dbpedia.org/ontology/>\n\nSELECT DISTINCT ?premiado ?nombre ?fechaFallec ?afiliación \nWHERE {\n  ?premiado rdf:type nobel:Laureate .                      # 1\n  ?premiado foaf:name ?nombre .                            # 2\n  ?premiado dbp:dateOfDeath ?fechaFallec .                 # 3\n  ?premiado dbo:affiliation ?afiliación .                  # 4\n}\nORDER BY ?premiado\n\nEl uso de OPTIONAL permite admitir filas de resultados con alguna celda en blanco (si se ha marcado como opcional). La siguiente consulta se resume como “encuentra los resultados del patrón {#1,#2} y amplía cada caso con su ?fechaFallec (si la hubiera) y amplía cada caso con su ?afiliacion (si la hubiera)”\n\nComo resultado se obtiene una tabla en que necesariamente las filas deben presentar valores en las columnas ?premiado y ?nombre al tiempo que puede o no haber valor en ?fechaFallec e independientemente puede o no haber valor en ?afiliación.PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX nobel: <http://data.nobelprize.org/terms/>\nPREFIX foaf: <http://xmlns.com/foaf/0.1/>\nPREFIX dbp: <http://dbpedia.org/property/>\nPREFIX dbo: <http://dbpedia.org/ontology/>\n\nSELECT DISTINCT ?premiado ?nombre ?fechaFallec ?afiliación \nWHERE {\n  ?premiado rdf:type nobel:Laureate .                      # 1\n  ?premiado foaf:name ?nombre .                            # 2\n  OPTIONAL {?premiado dbp:dateOfDeath ?fechaFallec .}      # Adicional 3\n  OPTIONAL {?premiado dbo:affiliation ?afiliación .}       # Adicional 4\n}\nORDER BY ?premiado\n\nEn la consulta anterior se usaron dos OPTIONAL para independizar la existencia de la fecha de fallecimiento de la existencia de la afiliación. En la siguiente consulta se requieren resultados para {#1,#2} que se pueden ampliar con los obtenidos al ejecutar el patrón {#3,#4}. Pero este último patrón facilita resultados sólo cuando existe a la vez fecha de fallecimiento y afiliación. Así, la tabla de resultados finales presenta dos tipos de filas:\n\nO bien aparecen valores en las 4 columnas\n\nO bien faltan valores, a la vez, fecha de fallecimiento y afiliación\n\n(No ocurrirá que pueda faltar independientemente tan sólo un valor entre fecha de fallecimiento y afiliación, como sí ocurría en la consulta previa).PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX nobel: <http://data.nobelprize.org/terms/>\nPREFIX foaf: <http://xmlns.com/foaf/0.1/>\nPREFIX dbp: <http://dbpedia.org/property/>\nPREFIX dbo: <http://dbpedia.org/ontology/>\n\nSELECT DISTINCT ?premiado ?nombre ?fechaFallec ?afiliación \nWHERE {\n  ?premiado rdf:type nobel:Laureate .                      # 1\n  ?premiado foaf:name ?nombre .                            # 2\n  OPTIONAL {\n    ?premiado dbp:dateOfDeath ?fechaFallec .\n    ?premiado dbo:affiliation ?afiliación .\n  }                                                       # Adicional {3,4}\n}\nORDER BY ?premiado\n\nEstas tres consultas conviene ejecutarlas en \n\nhttps://​data​.nobelprize​.org​/sparql, fijándose en cada caso en el número de resultados obtenidos y en los huecos presentes en cada fila.","type":"content","url":"/select-nobel-grupos-patrones#optional","position":11},{"hierarchy":{"lvl1":"Composición de patrones","lvl3":"MINUS","lvl2":"Grupos de patrones"},"type":"lvl3","url":"/select-nobel-grupos-patrones#minus","position":12},{"hierarchy":{"lvl1":"Composición de patrones","lvl3":"MINUS","lvl2":"Grupos de patrones"},"content":"En una consulta del tipo {grupo1} MINUS {grupo2} se evalúan independientemente los resultados de ambos grupos. Se devuelven a lo sumo los resultados del grupo1, descartando tan sólo aquéllos que también aparecen en el grupo2.\n\nConsulta: descarte de resultados mediante MINUS\n\nPara apreciar mejor el proceso de resta se ejecuta la siguiente consulta en con MINUS y #4 comentados: se antepone un signo # y esas líneas no se consideran ejecutables (sólo se ejecutan #1, #2 y #3).PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX nobel: <http://data.nobelprize.org/terms/>\nPREFIX foaf: <http://xmlns.com/foaf/0.1/>\nPREFIX dbp: <http://dbpedia.org/property/>\n\nSELECT DISTINCT ?reconocimiento ?premiado ?nombre\nWHERE {\n  { ?reconocimiento rdf:type nobel:LaureateAward .          #1\n    ?reconocimiento nobel:laureate ?premiado .              #2\n    ?premiado foaf:name ?nombre . }                         #3\n  # MINUS \n  # { ?premiado dbp:dateOfDeath ?fechaFallec .}             #4\n}\nORDER BY ?reconocimiento\n\nCuando se ejecuta en \n\nhttps://​data​.nobelprize​.org​/sparql se obtienen poco más de mil resultados en la tabla (?reconocimiento, ?premiado, ?nombre). En estos resultados es irrelevante que tengan o no fecha de fallecimiento.\n\nLa siguiente consulta construye una segunda tabla intermedia para el patrón {#4} con las columnas (?premiado, ?fechaFallecimiento). Las tablas para {#1,#2,#3} y {#4} tienen en común la variable ?premiado. En el resultado final, de la tabla para {#1,#2,#3} se eliminan las filas cuyo valor para ?premiado aparezca en la tabla de resultados para {#4}.PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX nobel: <http://data.nobelprize.org/terms/>\nPREFIX foaf: <http://xmlns.com/foaf/0.1/>\nPREFIX dbp: <http://dbpedia.org/property/>\n\nSELECT DISTINCT ?reconocimiento ?premiado ?nombre\nWHERE {\n  { ?reconocimiento rdf:type nobel:LaureateAward .          #1\n    ?reconocimiento nobel:laureate ?premiado .              #2\n    ?premiado foaf:name ?nombre . }                         #3\n  MINUS \n  { ?premiado dbp:dateOfDeath ?fechaFallec .}               #4\n}\nORDER BY ?reconocimiento\n\nSi se ejecuta esta consulta con MINUS en \n\nhttps://​data​.nobelprize​.org​/sparql se obtendrán los resultados de la consulta anterior excepto aquéllos con fecha de fallecimiento. Es decir, esta consulta tan sólo facilita los premiados vivos de la tabla anterior.","type":"content","url":"/select-nobel-grupos-patrones#minus","position":13},{"hierarchy":{"lvl1":"El vocabulario NobelPrize"},"type":"lvl1","url":"/select-nobel-vocabulario","position":0},{"hierarchy":{"lvl1":"El vocabulario NobelPrize"},"content":"Siempre se pueden ejecutar consultas generalistas sobre un repositorio desconocido para ir descubriendo su estructura. Para facilitar este acercamiento, los repositorios públicos presentan documentación sobre el nombre de sus clases, de sus propiedades y de cómo se usan para interrelacionar datos en el grafo que albergan.","type":"content","url":"/select-nobel-vocabulario","position":1},{"hierarchy":{"lvl1":"El vocabulario NobelPrize","lvl2":"Clases y propiedades en Nobelprizes"},"type":"lvl2","url":"/select-nobel-vocabulario#clases-y-propiedades-en-nobelprizes","position":2},{"hierarchy":{"lvl1":"El vocabulario NobelPrize","lvl2":"Clases y propiedades en Nobelprizes"},"content":"La especificación del vocabulario se encuentra en \n\nhttps://​data​.nobelprize​.org​/specification/\n\nEl siguiente diagrama (del estilo de un diagrama de clases) no debe confundirse con un grafo RDF. Restringe, p.ej, a cualquier elemento X de la clase NobelPrize (X type NobelPrize) a tener propiedades como ‘category’ (X category Y) y a relacionarse mediante la propiedad ‘laureate’ (X laureate Z) con algún elemento Z de la clase Laureate (Z type Laureate) , que puede tener propiedades como ‘name’ (Z name W).classDiagram\n\tNobelPrize --> LaureateAward : hasPart\n\tNobelPrize -->  Laureate : laureate\n\tLaureateAward -->  University : university\n\tLaureateAward --> Laureate : laureate\n\tLaureate --> LaureateAward : laureateAward\n\tLaureate --> NobelPrize : NobelPrize\n\tLaureate --> University : affiliation\n\tLaureate --> City : birthplace\n\tLaureate --> City : deathplace\n\tLaureate --> Country : birthplace\n\tLaureate --> Country : deathplace\n\tNobelPrize : label\n\tNobelPrize : year\n\tNobelPrize : motivation\n\tNobelPrize : category\n\tLaureateAward : label\n\tLaureateAward : year\n\tLaureateAward : motivation\n\tLaureateAward : share\n\tLaureateAward : contribution\n\tLaureate : name\n\tLaureate : givenName\n\tLaureate : familyName\n\tLaureate : gender\n\tLaureate : sameAs\n\tLaureate : dateOfBirth\n\tLaureate : dateOfDeath\n\tCity : label\n\tCity : sameAs\n\tCountry : label\n\tCountry : sameAs\n\tUniversity : label\n\tUniversity : country\n\tUniversity : city\n\nClase NobelPrize (Premio Nobel): cada año hay un único premio Nobel concedido por cada categoría, que puede repartirse a lo sumo entre tres personas o instituciones.\nz\n\nClase LaureateAward (Reconocimiento): como se puede compartir, hay un reconocimiento individualizado que tiene, entre otros atributos, la proporción reconocida a cada contribución\n\nClase Laureate (Premiado): la persona o institución que recibe el premio.","type":"content","url":"/select-nobel-vocabulario#clases-y-propiedades-en-nobelprizes","position":3},{"hierarchy":{"lvl1":"El vocabulario NobelPrize","lvl3":"Ejemplo: el Nobel de Medicina 1959","lvl2":"Clases y propiedades en Nobelprizes"},"type":"lvl3","url":"/select-nobel-vocabulario#ejemplo-el-nobel-de-medicina-1959","position":4},{"hierarchy":{"lvl1":"El vocabulario NobelPrize","lvl3":"Ejemplo: el Nobel de Medicina 1959","lvl2":"Clases y propiedades en Nobelprizes"},"content":"De manera informal, se representa algunos de los enunciados RDF que describen la concesión del Nobel de Medicina de 1959.flowchart TD\n    M(Medicina59) --> |type| N[NobelPrize]\n    M --> |category| CM[Medicina]\n    M --> |laureate| S(SevOchoa)\n    M --> |laureate| K(AKornb)\n    M --> |hasPart| M1(Medicina59-1)\n    M --> |hasPart| M2(Medicina59-2)\n    M1 --> |type| LA[LaureateAward]\n    M2 --> |type| LA\n    M1 --> |laureate| S\n    M2 --> |laureate| K\n    S --> |name| SL[[Severo Ochoa]]\n    K --> |name| KL[[Arthur Kornberg]]\n\nSevero Ochoa tiene por identificador http://data.nobelprize.org/resource/laureate/367 y una presentación html de sus datos se ofrece en la dirección (con https) \n\nhttps://​data​.nobelprize​.org​/resource​/laureate​/367. Esta página facilita los enunciados RDF sobre Severo Ochoa en varios formatos. Algunos de estos enunciados, en formato Turtle, son:<http://data.nobelprize.org/resource/laureate/367> \n    a <http://data.nobelprize.org/terms/Laureate>; \n    foaf:name \"Severo Ochoa\";\n    <http://data.nobelprize.org/terms/laureateAward> <http://data.nobelprize.org/resource/laureateaward/Physiology_or_Medicine/1959/367> ;\n    <http://data.nobelprize.org/terms/nobelPrize> <http://data.nobelprize.org/resource/nobelprize/Physiology_or_Medicine/1959>;\n    <http://dbpedia.org/ontology/birthPlace> <http://data.nobelprize.org/resource/country/Spain> ;\n    owl:sameAs <http://www.wikidata.org/entity/Q233957> .\n\n\nLos datos sobre Arthur Kornberg se presentan en la página \n\nhttps://​data​.nobelprize​.org​/resource​/laureate​/368, desde donde se pueden descargar sus enunciados RDF.","type":"content","url":"/select-nobel-vocabulario#ejemplo-el-nobel-de-medicina-1959","position":5},{"hierarchy":{"lvl1":"El vocabulario NobelPrize","lvl2":"Premios, reconocimientos y premiados"},"type":"lvl2","url":"/select-nobel-vocabulario#premios-reconocimientos-y-premiados","position":6},{"hierarchy":{"lvl1":"El vocabulario NobelPrize","lvl2":"Premios, reconocimientos y premiados"},"content":"Se proponen consultas cuyo patrón consta de dos enunciados. El primero sirve para restringir el colectivo de elementos de interés (Premios, Reconocimientos o Premiados). Y el segundo enunciado simplemente recaba toda la información sobre cada elemento.","type":"content","url":"/select-nobel-vocabulario#premios-reconocimientos-y-premiados","position":7},{"hierarchy":{"lvl1":"El vocabulario NobelPrize","lvl3":"Todo, de cada Premio Nobel","lvl2":"Premios, reconocimientos y premiados"},"type":"lvl3","url":"/select-nobel-vocabulario#todo-de-cada-premio-nobel","position":8},{"hierarchy":{"lvl1":"El vocabulario NobelPrize","lvl3":"Todo, de cada Premio Nobel","lvl2":"Premios, reconocimientos y premiados"},"content":"Consulta: de cada Premio Nobel X, todos sus enunciados <X> <prop> <obj>PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX nobel: <http://data.nobelprize.org/terms/>\n\nSELECT ?premioNobel ?propiedad ?objeto\nWHERE {\n  ?premioNobel rdf:type nobel:NobelPrize .\n  ?premioNobel ?propiedad ?objeto .\n}\nORDER BY ?premioNobel\nLIMIT 100000\n\nEstructura de la consulta\n\nEste patrón de consulta consta de dos enunciados. Cada concordancia debe cumplir ambos: un determinado identificador del tipo NobelPrize que además aparece como sujeto de enunciados.\n\nEl siguiente diagrama informal muestra el término Premio37 que cumple ser Premio Nobel (luego es candidato, a medias, a cumplir el patrón) y además es sujeto (entre otros) de un enunciado como <Premio37> <propiedad2> <valorL>. Es decir, para las variables del patrón (?premioNobel, ?propiedad, ?objeto) los valores (Premio37, propiedad2, valorL) hace concordar el patrón con el grafo.flowchart LR\n\tP(Premio37) --> |type| N[PremioNobel]\n\tP --> |propiedad1| VK(valorK)\n\tP --> |propiedad2| VL(valorL)\n\tP --> |propiedad3| VM(valorM)\n\nLa tabla de resultados que se produce internamente es la siguiente:\\begin{array}{ccc}\n?premioNobel & ?propiedad & ?objeto \\\\ \\hline\nPremio35 & type & PremioNobel \\\\\nPremio35 & propiedad & valor \\\\\nPremio35 & otra\\_propiedad & su\\_valor\n\\end{array}\n\nResultados. Cuando se copia, pega y ejecuta la consulta en \n\nhttps://​data​.nobelprize​.org​/sparql se obtienen algo más de veintiocho mil resultados.","type":"content","url":"/select-nobel-vocabulario#todo-de-cada-premio-nobel","position":9},{"hierarchy":{"lvl1":"El vocabulario NobelPrize","lvl3":"Todo, de cada Premiado","lvl2":"Premios, reconocimientos y premiados"},"type":"lvl3","url":"/select-nobel-vocabulario#todo-de-cada-premiado","position":10},{"hierarchy":{"lvl1":"El vocabulario NobelPrize","lvl3":"Todo, de cada Premiado","lvl2":"Premios, reconocimientos y premiados"},"content":"Consulta: de cada Premiado X, todos sus enunciados <X> <prop> <obj>PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX nobel: <http://data.nobelprize.org/terms/>\n\nSELECT ?premiado ?propiedad ?objeto\nWHERE {\n  ?premiado rdf:type nobel:Laureate .\n  ?premiado ?propiedad ?objeto .\n}\nORDER BY ?premiado\nLIMIT 100000\n\nResultados. Cuando se copia, pega y ejecuta la consulta en \n\nhttps://​data​.nobelprize​.org​/sparql se obtienen casi setenta y dos mil resultados.","type":"content","url":"/select-nobel-vocabulario#todo-de-cada-premiado","position":11},{"hierarchy":{"lvl1":"El vocabulario NobelPrize","lvl3":"Todo, de cada Reconocimiento","lvl2":"Premios, reconocimientos y premiados"},"type":"lvl3","url":"/select-nobel-vocabulario#todo-de-cada-reconocimiento","position":12},{"hierarchy":{"lvl1":"El vocabulario NobelPrize","lvl3":"Todo, de cada Reconocimiento","lvl2":"Premios, reconocimientos y premiados"},"content":"Consulta: de cada Reconocimiento X, todos sus enunciados <X> <prop> <obj>PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX nobel: <http://data.nobelprize.org/terms/>\n\nSELECT ?reconocimiento ?propiedad ?objeto\nWHERE {\n  ?reconocimiento rdf:type nobel:LaureateAward .\n  ?reconocimiento ?propiedad ?objeto .\n}\nORDER BY ?reconocimiento\nLIMIT 100000\n\nResultados. Cuando se copia, pega y ejecuta la consulta en \n\nhttps://​data​.nobelprize​.org​/sparql se obtienen casi cincuenta y seis mil resultados.","type":"content","url":"/select-nobel-vocabulario#todo-de-cada-reconocimiento","position":13},{"hierarchy":{"lvl1":"Clasificaciones en Wikidata"},"type":"lvl1","url":"/select-wikidata-clases","position":0},{"hierarchy":{"lvl1":"Clasificaciones en Wikidata"},"content":"Algunos ítems de Wikidata se usan como agrupadores de otros ítems, es decir, como clases. Hay clases, como la de los Vertebrados, que forman parte de la jerarquía conceptual de análisis de un área de conocimiento. Y hay otras clases puramente instrumentales en Wikidata, que se crean para agrupar ítems con una característica de interés para la base de datos del repositorio. Cada ítem se puede asignar a una o más clases.","type":"content","url":"/select-wikidata-clases","position":1},{"hierarchy":{"lvl1":"Clasificaciones en Wikidata","lvl2":"Propiedades para clasificar"},"type":"lvl2","url":"/select-wikidata-clases#propiedades-para-clasificar","position":2},{"hierarchy":{"lvl1":"Clasificaciones en Wikidata","lvl2":"Propiedades para clasificar"},"content":"Instancia y subclase. Corresponden a las relaciones de pertenencia de un elemento a un conjunto y a la de subconjunto de elementos incluidos en otro conjunto.\n\nParte y faceta. Estas dos relaciones estrictamente no participan en la clasificación de entidades. La primera sirve para descomponer algo en componentes y la segunda para sugerir una relación difusa entre conceptos.","type":"content","url":"/select-wikidata-clases#propiedades-para-clasificar","position":3},{"hierarchy":{"lvl1":"Clasificaciones en Wikidata","lvl3":"Pertenencia","lvl2":"Propiedades para clasificar"},"type":"lvl3","url":"/select-wikidata-clases#pertenencia","position":4},{"hierarchy":{"lvl1":"Clasificaciones en Wikidata","lvl3":"Pertenencia","lvl2":"Propiedades para clasificar"},"content":"La clasificación de ítems se produce a través de la relación de pertenencia, que en RDF se formaliza como rdf:type. En Wikidata se ha optado por una versión propia de esta relación (rdf:type) y para ello se usa la propiedad P31 alternativamente.\n\nLa siguiente consulta cuenta el número de instancias asignadas explícitamente en Wikidata a la clase “ser_humano” (Q5):\n\nConsulta: recuento de las instancias de la clase ‘ser humano’SELECT (COUNT(?s) AS ?sNum)\nWHERE {\n  ?s wdt:P31 wd:Q5.\n}\n\nEjecución en Wikidata","type":"content","url":"/select-wikidata-clases#pertenencia","position":5},{"hierarchy":{"lvl1":"Clasificaciones en Wikidata","lvl3":"Subclases","lvl2":"Propiedades para clasificar"},"type":"lvl3","url":"/select-wikidata-clases#subclases","position":6},{"hierarchy":{"lvl1":"Clasificaciones en Wikidata","lvl3":"Subclases","lvl2":"Propiedades para clasificar"},"content":"La relación estándar en RDF es rdfs:subClassOf. De nuevo, Wikidata utiliza internamente una versión propia (de rdfs:subClassOf) en forma de la propiedad P279. La siguiente consulta devuelve las trescientas clases declaradas directa y explícitamente como subclases de Q5.\n\nConsulta: todas las subclases directas de la clase ‘ser humano’SELECT ?clase ?claseLabel\nWHERE {\n  ?clase wdt:P279 wd:Q5 .\n  SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\n\nEjecución en Wikidata\n\nJerarquía de subclases. Las subclases de Q5 pueden tener a su vez sus propias subclases. Y éstas, a su vez, otras subclases. La siguiente consulta devuelve todas en la jerarquía de (sub)subclases de Q5. En total, unas 4.700 clases.\n\nConsulta: recursivamente, todas las subclases (directas y a más bajo nivel)SELECT ?clase ?claseLabel\nWHERE {\n  ?clase wdt:P279+ wd:Q5 .\n  SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\n\nEjecución en Wikidata\n\nEn esta consulta se ha utilizado el patrón de consulta \"?clase wdt:P279+ wd:Q5\", donde el signo ‘+’ significa: “una o más composiciones reiteradas del camino wdt:P279”. Es decir, lo cumplen las entidades que sean subclases directas de Q5, pero también las que sean subclases de subclases de Q5 (wdt:P279/wdt:P279), las que estén a distancia 3 (wdt:P279/wdt:279/wdt:P279), etc.flowchart LR\n    SSSC[subsubsubclase] --> |wdt:P279| SSC[subsubclase]\n    SSC --> |wdt:P279| SC[subclase]\n    SC --> |wdt:P279| C[clase]\n\nCaminos de propiedades (Property Paths)\n\nLa composición de caminos indicada en wdt:P279+ es una de las opciones posibles en las búsquedas SPARQL. Se ejemplifican con P31 y P279 pero son aplicables a cualquier propiedad.\n\nwdtP279+: una o más composiciones de esta propiedad;  wdtP279*: cero o más composiciones;  wdtP279?: cero o una composición.\n\nwdt:P31/wdtP279*: un enlace de tipo pertenencia (P31) seguido de cero o más de tipo subclase (P279)\n\nwdt:P31|wdt:P279: salto desde un nodo siguiendo o bien un enlace P31 o bien un enlace P279\n\nUna consulta previa \n\ncontaba las instancias directas de la clase ‘ser humano’. Otra consulta \n\ncontaba recursivamente todas las subclases de la clase ‘ser humano’. La siguiente consulta cuenta todas las instancias de alguna subclase de Q5, en cualquier nivel de inclusión:\n\nConsulta: recursivamente, todas las subclases (directas y a más bajo nivel)SELECT (COUNT(?s) AS ?sNum)\nWHERE {\n  ?s wdt:P31/wdt:P279* wd:Q5.\n}\n\nEjecución en Wikidata\nEsta consulta considera:\n\n(<s><wdt:P31><wd:Q5) los elementos directos de Q5\n\n(<s><wdt:P31><X, <X><wdt:P279><wd:Q5>) los elementos de cualquier subclase directa\n\n(<s><wdt:P31><X, <X><wdt:P279><Y>``<Y><wdt:P279><wd:Q5>)  los de cualquier subsubclase\n\n... y cualquier elemento de una subclase (a cualquier nivel de anidamiento) de Q5","type":"content","url":"/select-wikidata-clases#subclases","position":7},{"hierarchy":{"lvl1":"Clasificaciones en Wikidata","lvl3":"Parte","lvl2":"Propiedades para clasificar"},"type":"lvl3","url":"/select-wikidata-clases#parte","position":8},{"hierarchy":{"lvl1":"Clasificaciones en Wikidata","lvl3":"Parte","lvl2":"Propiedades para clasificar"},"content":"La clase ‘vehículo de motor’ puede tener miles de instancias, todas ellas similares en tanto que cumplen por igual lo que se requiere para pertenecer a esta clase. Y esta clase puede tener subclases como ‘camión’, con sus instancias (que además lo son de la superclase que contiene a ‘camión’).\n\nAhora bien, el concepto de qué es un vehículo de motor, qué se precisa para ser reconocido como instancia de esa clase, requiere describir algunos componentes (o partes) y cómo interaccionan. Todas estas instancias se componen de partes como ‘motor’ o como ‘rueda’ (si no se concibe un vehículo de motor sin ruedas).\n\nLa siguiente consulta recupera enunciados de Wikidata en que se afirma que el sujeto es ‘parte de’ (P361) algo.\n\nConsulta: enunciados que declaran ‘parte de’ algoSELECT ?parte ?parteLabel ?parte_de ?todo ?todoLabel\nWHERE {\n  BIND(wdt:P361 AS ?parte_de)\n  ?parte ?parte_de ?todo .\n  SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nLIMIT 40000\n\nEjecución en Wikidata","type":"content","url":"/select-wikidata-clases#parte","position":9},{"hierarchy":{"lvl1":"Clasificaciones en Wikidata","lvl3":"Faceta","lvl2":"Propiedades para clasificar"},"type":"lvl3","url":"/select-wikidata-clases#faceta","position":10},{"hierarchy":{"lvl1":"Clasificaciones en Wikidata","lvl3":"Faceta","lvl2":"Propiedades para clasificar"},"content":"De las relaciones “subclase_de” y “parte_de” se espera conceptualmente que sean transitivas: si “X es parte de Y” y “Y es parte de Z” se desearía poder afirmar que “X es parte de Z”. Pero hay relaciones entre conceptos más laxas formalmente. Por ejemplo, se podría afirmar que el concepto de ‘contaminación’ es una de las facetas del concepto “vida urbana”. Uno es una perspectiva acotada del otro, está relacionado desde un cierto punto de vista.\n\nLa siguiente consulta recupera enunciados de Wikidata en que se afirma que el sujeto es ‘faceta de’ (P1269) el objeto.\n\nConsulta: enunciados que declaran ‘ser faceta de’ algoSELECT ?item1 ?item1Label ?faceta_de ?item2 ?item2Label\nWHERE {\n  BIND(wdt:P1269 AS ?faceta_de)\n  ?item1 ?faceta_de ?item2 .\n  SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}  \nLIMIT 40000 \n\nEjecución en Wikidata","type":"content","url":"/select-wikidata-clases#faceta","position":11},{"hierarchy":{"lvl1":"Clasificaciones en Wikidata","lvl2":"Clases y subclases en Wikidata"},"type":"lvl2","url":"/select-wikidata-clases#clases-y-subclases-en-wikidata","position":12},{"hierarchy":{"lvl1":"Clasificaciones en Wikidata","lvl2":"Clases y subclases en Wikidata"},"content":"Hay casi cien mil clases utilizadas en Wikidata hasta la fecha. No se declaran formalmente como tal: la clase X lo es porque existe un ítem que pertenece (P31) a la misma, no porque exista un enunciado “X rdf:type rdfs:Class”.","type":"content","url":"/select-wikidata-clases#clases-y-subclases-en-wikidata","position":13},{"hierarchy":{"lvl1":"Clasificaciones en Wikidata","lvl3":"Clases y sus elementos","lvl2":"Clases y subclases en Wikidata"},"type":"lvl3","url":"/select-wikidata-clases#clases-y-sus-elementos","position":14},{"hierarchy":{"lvl1":"Clasificaciones en Wikidata","lvl3":"Clases y sus elementos","lvl2":"Clases y subclases en Wikidata"},"content":"La siguiente consulta devuelve todas clases utilizadas en Wikidata junto a los elementos que pertenecen a la clase.\n\nConsulta: todas las clases en Wikidata con su número de elementos\nSELECT ?clase (COUNT(?item) AS ?numElementos)\nWHERE {\n  ?item wdt:P31 ?clase.\n}\nGROUP BY ?clase\nORDER BY DESC(?numElementos)\n\nEjecución en Wikidata","type":"content","url":"/select-wikidata-clases#clases-y-sus-elementos","position":15},{"hierarchy":{"lvl1":"Clasificaciones en Wikidata","lvl3":"Pares (subclase, clase)","lvl2":"Clases y subclases en Wikidata"},"type":"lvl3","url":"/select-wikidata-clases#pares-subclase-clase","position":16},{"hierarchy":{"lvl1":"Clasificaciones en Wikidata","lvl3":"Pares (subclase, clase)","lvl2":"Clases y subclases en Wikidata"},"content":"La siguiente consulta devuelve todos los pares de clases (A,B) donde A es subclase de B. Sobre las cien mil clases en Wikidata aparecen casi tres millones y medio de relaciones de (subclase, clase).\n\nConsulta: todos los pares (clase1 subclase clase2)SELECT ?clase ?claseSup \nWHERE {\n  ?clase wdt:P279 ?claseSup . \n}\n\nEjecución en Wikidata","type":"content","url":"/select-wikidata-clases#pares-subclase-clase","position":17},{"hierarchy":{"lvl1":"Clasificaciones en Wikidata","lvl2":"Inferencia sobre subclases"},"type":"lvl2","url":"/select-wikidata-clases#inferencia-sobre-subclases","position":18},{"hierarchy":{"lvl1":"Clasificaciones en Wikidata","lvl2":"Inferencia sobre subclases"},"content":"La pertencia explícita de una instancia I a una clase C en RDF asegura que se puede deducir la pertenencia de I a cualquiera de las superclases donde C esté transitivamente incluida. Es decir, si C es una sub/sub/.../subclase de Vertebrados, de cualquier instancia de C se puede deducir que pertenece a esta última clase, incluso aunque ese enunciado no conste explícitamente en la base de datos.\n\nEsta inferencia estándar RDFS no se facilita en Wikidata.","type":"content","url":"/select-wikidata-clases#inferencia-sobre-subclases","position":19},{"hierarchy":{"lvl1":"Clasificaciones en Wikidata","lvl3":"Inferencia en RDF","lvl2":"Inferencia sobre subclases"},"type":"lvl3","url":"/select-wikidata-clases#inferencia-en-rdf","position":20},{"hierarchy":{"lvl1":"Clasificaciones en Wikidata","lvl3":"Inferencia en RDF","lvl2":"Inferencia sobre subclases"},"content":"En RDFS se definen varias reglas, que son las que permiten asegurar inferencias como la anteriormente expuesta:\n\nLa pertenencia (rdf:type) se transmite de subclase (rdfs:subClassOf) a superclase.\\left\\rvert\\begin{array}{ccc}\n\\text{ <elem>} &  \\text{<rdf:type>} & \\text{<C1> } \\\\\n\\text{ <C1>} &  \\text{<rdfs:subClassOf>} &  \\text{<C2> }     \n\\end{array}\\right\\rangle\n\\Rightarrow \\text{ <elem> <rdf:type> <C2>}\n\nLa inclusión es transitiva y genera una jerarquía de clases.\\left\\rvert\\begin{array}{ccc}\n\\text{<C1>} &  \\text{<rdfs:subClassOf>} & \\text{<C2> } \\\\\n\\text{<C2>} &  \\text{<rdfs:subClassOf>} &  \\text{<C3> }     \n\\end{array}\\right\\rangle\n\\Rightarrow \\text{ <C1> <rdfs:subClassOf> <C3>}","type":"content","url":"/select-wikidata-clases#inferencia-en-rdf","position":21},{"hierarchy":{"lvl1":"Clasificaciones en Wikidata","lvl3":"Inferencia en Wikidata","lvl2":"Inferencia sobre subclases"},"type":"lvl3","url":"/select-wikidata-clases#inferencia-en-wikidata","position":22},{"hierarchy":{"lvl1":"Clasificaciones en Wikidata","lvl3":"Inferencia en Wikidata","lvl2":"Inferencia sobre subclases"},"content":"Wikidata no activa reglas similares para P31 y P279. No obstante, se puede forzar explícitamente en consultas SPARQL el retorno de resultados en una forma similar a los que se esperarían por inferencia. Para estas consultas se utilizan los ‘Path Properties’ de SPARQL: las propiedades compuestas como caminos de propiedades.\n\nLa siguiente consulta devuelve todas las subclases propias de Pintura (Q3305213), no importa a qué nivel se encuentren.\n\nConsulta: todas las subclases, a cualquier nivel, de PinturaSELECT ?C ?CLabel\nWHERE {\n  ?C wdt:P279+ wd:Q3305213 .\n  SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\n\nEjecución en Wikidata\n\nLa consulta anterior se puede refinar para facilitar, de cada una de esas subclases debajo de Pintura, su superclase inmediata.\n\nConsulta: todas las subclases, a cualquier nivel, de Pintura (2)SELECT ?Csub ?CsubLabel ?Csuper ?CsuperLabel\nWHERE {\n  ?Csub wdt:P279+ wd:Q3305213 .\n  ?Csub wdt:P279 ?Csuper .\n  SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}  \n\nEjecución en Wikidata\n\nLa siguiente consulta devuelve todas las instancias de todas las subclases de Pintura.\n\nConsulta: todas las instancias de todas las subclases, a cualquier nivel, de PinturaSELECT ?elem ?clase\nWHERE {\n  ?elem wdt:P31/wdt:P279* wd:Q3305213 .\n  ?elem wdt:P31 ?clase .\n}\nORDER BY ?clase\n\nEjecución en Wikidata","type":"content","url":"/select-wikidata-clases#inferencia-en-wikidata","position":23},{"hierarchy":{"lvl1":"Enunciados en Wikidata"},"type":"lvl1","url":"/select-wikidata-enunciados","position":0},{"hierarchy":{"lvl1":"Enunciados en Wikidata"},"content":"Los identificadores en Wikidata no son legibles (en algún idioma). Comienzan por un prefijo propio (mayoritariamente wd: o wdt:) y finalizan ese identificador URI por Qxxx o por Pxxx. Los siguientes enunciados, tal y como se codifican en Wikidata, se representan en el grafo posterior.\n\n\"<Francia (Q142)> <tiene por capital (P36)> <París (Q90)>\n\n<Francia (Q142)> <tiene una población (P1028) de> 68.000.000\".flowchart LR\n    F(\"wd:Q142\") --> |\"wdt:P36\"| P(\"wd:Q90\")\n    P --> |\"rdfs:label\"| PL[[\"'París'@es\"]]\n    F --> |\"rdfs:label\"| FL[[\"'Francia'@es\"]]\n    F --> |\"wdt:P1082\"| NL[[\"'68.000.000'\"]]\n\nAdicionalmente, se han añadido enunciados que asignan una etiqueta textual (rdfs:label), en español en este caso. Formalmante, las tripletas almacenadas son:PREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n\nwd:Q142 wdt:P36 wd:Q90 .\nwd:Q142 wdt:P1082 \"68.000.000\" .\nwd:Q142 rdfs:label \"Francia\"@es .\nwd:Q90 rdfs:label \"París\"@es .","type":"content","url":"/select-wikidata-enunciados","position":1},{"hierarchy":{"lvl1":"Enunciados en Wikidata","lvl2":"Identificadores en Wikidata"},"type":"lvl2","url":"/select-wikidata-enunciados#identificadores-en-wikidata","position":2},{"hierarchy":{"lvl1":"Enunciados en Wikidata","lvl2":"Identificadores en Wikidata"},"content":"Los identificadores del ejemplo anterior son direcciones URL que comienzan con espacios de nombre propios de Wikidata (wd, wdt) y alguno ajeno (rdfs). Y, en el caso de los datos propios de Wikidata, finalizan por un código Q (Q142 ó Q90) o un código P (P36, P1082).","type":"content","url":"/select-wikidata-enunciados#identificadores-en-wikidata","position":3},{"hierarchy":{"lvl1":"Enunciados en Wikidata","lvl3":"Q-ítems","lvl2":"Identificadores en Wikidata"},"type":"lvl3","url":"/select-wikidata-enunciados#q-tems","position":4},{"hierarchy":{"lvl1":"Enunciados en Wikidata","lvl3":"Q-ítems","lvl2":"Identificadores en Wikidata"},"content":"Cada concepto que se describe en Wikidata, con enunciados sobre ese sujeto, tiene asignado un código Q numerado. Estos conceptos descritos en Wikidata se conocen como ítems. Todos ellos se agrupan en un mismo espacio de nombres (wd).\n\n<http://www.wikidata.org/entity/Q142> , abreviado como wd:Q142, es el identificador fijo y público de Francia en Wikidata","type":"content","url":"/select-wikidata-enunciados#q-tems","position":5},{"hierarchy":{"lvl1":"Enunciados en Wikidata","lvl3":"P-propiedades","lvl2":"Identificadores en Wikidata"},"type":"lvl3","url":"/select-wikidata-enunciados#p-propiedades","position":6},{"hierarchy":{"lvl1":"Enunciados en Wikidata","lvl3":"P-propiedades","lvl2":"Identificadores en Wikidata"},"content":"Cada propiedad que se utiliza en Wikidata tienen asignado un código P numerado. El mismo código P se puede ver precedido de distintos espacios de nombre, para diferenciar sus usos sintácticos. De momento nos restringimos al uso de la propiedad en enunciados directos (wdt):\n\n<X> <http://www.wikidata.org/prop/direct/P36> <Y>, abreviado como wdt:P36, es el identificador de la propiedad tiene_capital cuando se usa en enunciados directos, para asignar a X su capital Y.\n\nConviene resaltar que tiene_capital, aparte de su uso funcional como propiedad, es en sí mismo un concepto del que se pueden declarar enunciados que lo describen, donde aparece como sujeto. En este caso, P36 como sujeto aparece con el mismo espacio de nombres que el resto de los ítems de Wikidata (wd).\n\n<http://www.wikidata.org/entity/P36>, abreviado como wd:P36 es el identificador de tiene_capital cuando aparece como sujeto en enunciados sobre este ítem.","type":"content","url":"/select-wikidata-enunciados#p-propiedades","position":7},{"hierarchy":{"lvl1":"Enunciados en Wikidata","lvl2":"Enunciados en Wikidata"},"type":"lvl2","url":"/select-wikidata-enunciados#enunciados-en-wikidata","position":8},{"hierarchy":{"lvl1":"Enunciados en Wikidata","lvl2":"Enunciados en Wikidata"},"content":"","type":"content","url":"/select-wikidata-enunciados#enunciados-en-wikidata","position":9},{"hierarchy":{"lvl1":"Enunciados en Wikidata","lvl3":"Enunciados directos","lvl2":"Enunciados en Wikidata"},"type":"lvl3","url":"/select-wikidata-enunciados#enunciados-directos","position":10},{"hierarchy":{"lvl1":"Enunciados en Wikidata","lvl3":"Enunciados directos","lvl2":"Enunciados en Wikidata"},"content":"La capitalidad de Francia se puede declarar en un enunciado directo, como ya se ha visto, o expresándola como una estructura RDF más compleja, mediante reificación o como relación n-aria. Como enunciado directo tiene la siguiente expresión.\n\nEnunciados RDF en Wikidata: Francia tiene por capital ParísPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nwd:Q142 wdt:P36 wd:Q90 .flowchart LR\n    F(\"wd:Q142\") --> |\"wdt:P36\"| P(\"wd:Q90\")\n\nLa siguiente consulta SPARQL pregunta por el valor de la variable ?capital para Francia. Y de este valor solicita todas sus etiquetas, de las que tan sólo se queda con la etiqueta en español. El único resultado de la consulta es: (wd:Q90, “París”@es)\n\nConsulta: capital de Francia, con su etiqueta en españolPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n\nSELECT ?capital ?capitalEtiq\nWHERE {\n  wd:Q142 wdt:P36 ?capital .\n  ?capital rdfs:label ?capitalEtiq .\n  FILTER(LANG(?capitalEtiq)=\"es\")\n}\n\nEjecución de la consulta\n\nSe puede copiar, pegar y ejecutar esta consulta en \n\nhttps://​query​.wikidata​.org/.\n\nTras una ejecución, se obtuvo allí el enlace \n\nhttps://w.wiki/6egu, que  transmite esta consulta a esa dirección y nos sitúa en ese interfaz para ejecutarla.\n### Enunciados indirectos\nEn principio, Wikidata no almacena inicialmente un enunciado como *wd:Q142 wdt:P36 wd:Q90* (\"Francia tiene por capital París\") de forma directa. Utiliza una estructura de almacenamiento algo más compleja pero versátil:\n\n+ De Francia, 'acerca de su capitalidad' (p:P36), se afirma 'una sentencia' (nodo en blanco)\n  - y en esta 'sentencia' compuesta se asigna capitalidad (ps:P36) con valor París (wd:90)\n  - adicionalmente en esta 'sentencia' se asigna *desde fecha* (con valor ...)\n  - adicionalmente en esta 'sentencia' se asigna *hasta fecha* (con valor ...)\n  - adicionalmente es esta 'sentencia' se puede añadir *otra_propiedad* (con valor ...)\n  - ...\n\n```mermaid\nflowchart LR\n    F(wd:Q142) --> |\"p:P36, (sobre capitalidad)\"| B(\" \")\n    B --> |\"ps:P580 (desde fecha)\"| I1(\"...\")\n    B --> |\"ps:P36 (asigna capitalidad)\"| P(wd:Q90)\n    B --> |\"ps:P582 (hasta fecha)\"| I2(\"...\")\n    B --> |\"asigna_info_adicional\"| I3(\"...\")\n```\n\nEn resumen, sobre Francia y acerca de su capitalidad (p:P36) se enuncia un 'statement' complejo (un nodo en blanco, con identificador interno asignado por el sistema). Y en este nodo en blanco se van asignando valores a propiedades.\n+ Dentro del 'statement' la asignación del valor de capitalidad es `ps:P36` (con prefijo ps), mientras que externamente la propiedad `p:P36` conducía de Francia al statement sobre su capitalidad.\n+ De igual forma, otras propiedades Pxxx se usan con prefijo ps:Pxxx cuando asignan valores dentro de un statement (y se usan como p:Pxxx) cuando relacionan un término con un statement acerca de esa propiedad.\n\nOcurre que _Francia_ ha tenido históricamente varias capitales, alguna de ellas en el exilio durante la Segunda Guerra Mundial. Todas ellas se han registrado en Wikidata en su formato usual, como enunciado indirecto.  La siguiente consulta recorre los enunciados indirectos (los statements) sobre capitalidad de Francia y recupera más de uno. Por legilibidad de la consulta, no se pregunta por las fechas de inicio y fin.\n\n:::::{hint} Consulta: enunciados indirectos que asignan capitalidad a Francia\n:label: query-capital-francia-enunciados-indirectos\n:class: dropdown\n:open: \n```SPARQL\nSELECT ?stmt ?capital ?capitalEtiq\nWHERE {\n  wd:Q142 p:P36 ?stmt .\n  ?stmt ps:P36 ?capital .\n  ?capital rdfs:label ?capitalEtiq .\n  FILTER(LANG(?capitalEtiq)=\"es\")\n}\n```\n[Ejecución en Wikidata](https://w.wiki/DaC3)\n\nWikidata exporta como enunciados directos algunos de estos enunciados indirectos. La exportación se decide atendiendo a varios requisitos, entre los que se incluye la mayor verosimilitud o, en casos como el de capitalidades, manteniendo como enunciado directo tan sólo la capital actual. De esta forma, \n\nse pudo ejecutar una consulta SPARQL sobre capitalidad de Francia buscando enunciados directos (X wdt:P36 Y) y devolvía un solo resultado: su capital actual.\n\nObviar los enunciados indirectos en una primera aproximación\n\nInicialmente se puede considerar que Wikidata expone toda su información en forma de enunciados directos <wd:Qxxx> <wdt:Pzzz> <wd:Qyyyy> y reservar para un uso más especializado la consulta a enunciados indirectos como <wd:Qxxx> <p:Pzzz> <_:stmtK> y <_:stmtK> <ps:Pzzzz> <wd:Qyyy> (quizá con otras tripletas informativas añadidas desde _:stmtK).","type":"content","url":"/select-wikidata-enunciados#enunciados-directos","position":11},{"hierarchy":{"lvl1":"Enunciados en Wikidata","lvl2":"Etiquetas en Wikidata"},"type":"lvl2","url":"/select-wikidata-enunciados#etiquetas-en-wikidata","position":12},{"hierarchy":{"lvl1":"Enunciados en Wikidata","lvl2":"Etiquetas en Wikidata"},"content":"Cada Q-ítem en Wikidata tiene asignadas varias etiquetas textuales mediante tripletas <Qxxx> <prop> <etiqueta>. En concreto, por cada idioma, un ítem tiene asignadas:\n\nUna etiqueta textual principal (mediante la propiedad rdfs:label)\n\nUna descripción textual más extensa (mediante la propiedad schema:description)\n\nY opcionalmente varias etiquetas alternativas (mediante la propiedad skos:altLabel)\n\nTodo ello posiblemente repetido para más de un idioma. La siguiente consulta demanda todas las etiquetas principales (rdfs:label) de Francia y adicionalmente extrae de ellas el idioma: por ejemplo, de “Francia”@es extrae ‘es’ (español).\n\nConsulta: Etiquetas principales asociadas a Francia (Q142), con su idiomaSELECT ?etiqueta ?idioma\nWHERE {\n  wd:Q142 rdfs:label ?etiqueta .\n  BIND(LANG(?etiqueta) AS ?idioma)\n}\n\nEjecución en Wikidata","type":"content","url":"/select-wikidata-enunciados#etiquetas-en-wikidata","position":13},{"hierarchy":{"lvl1":"Enunciados en Wikidata","lvl3":"Filtrado por idiomas","lvl2":"Etiquetas en Wikidata"},"type":"lvl3","url":"/select-wikidata-enunciados#filtrado-por-idiomas","position":14},{"hierarchy":{"lvl1":"Enunciados en Wikidata","lvl3":"Filtrado por idiomas","lvl2":"Etiquetas en Wikidata"},"content":"En una consulta previa ya se ha mostrado como filtrar resultados por un idioma concreto utilizando FILTER. Wikidata facilita la consulta a un servicio adicional (específicamente indexado) para facilitar este filtrado por idiomas. Se utiliza en la siguiente consulta.\n\nConsulta: filtrado por idiomas más eficiente usanod wikibase:languageSELECT ?capital ?capitalLabel ?capitalDescription ?capitalAltLabel\nWHERE {\n  wd:Q142 wdt:P36 ?capital .                                             #1\n  SERVICE wikibase:label { bd:serviceParam wikibase:language \"es,en\". }  #2\n}\n\nEjecución en Wikidata\n\nLa llamada a este servicio (en #2) devuelve, para cada valor de cada variable en WHERE, sus etiquetas en un idioma. El filtrado indica que se busquen etiquetas en español y, si no se encontraran, que se faciliten en inglés.\n\nEste servicio devuelve la etiqueta principal de una variable (?variable) en ?variableLabel, la descripción en ?variableDescription y el conjunto agregado de etiquetas alternativas en ?variableAltLabel. Es decir, para una variable discrecionalmente denominada ?capital hay que buscar obligatoriamente estas etiquetas textuales en ?capitalLabel, ?capitalDescription, ?capitalAltLabel, que deben escribirse literalmente con esos sufijos.","type":"content","url":"/select-wikidata-enunciados#filtrado-por-idiomas","position":15},{"hierarchy":{"lvl1":"Consultas SELECT (Wikidata)"},"type":"lvl1","url":"/select-wikidata-intro","position":0},{"hierarchy":{"lvl1":"Consultas SELECT (Wikidata)"},"content":"Avance\n\nEsta sección tiene dos objetivos complementarios:\n\nPor un lado, se continúa trabajando sobre consultas SPARQL de tipo SELECT\n\nPor otro lado, las consultas ahora se ejecutan sobre el dataset de Wikidata para facilitar el estudio de su estructura.","type":"content","url":"/select-wikidata-intro","position":1},{"hierarchy":{"lvl1":"Consultas SELECT (Wikidata)","lvl2":"Sobre Wikidata"},"type":"lvl2","url":"/select-wikidata-intro#sobre-wikidata","position":2},{"hierarchy":{"lvl1":"Consultas SELECT (Wikidata)","lvl2":"Sobre Wikidata"},"content":"Wikidata (\n\nhttps://​www​.wikidata​.org) es una base de conocimiento generalista formada por enunciados que describen, clasifican y relacionan millones de ítems (entidades físicas o conceptos). Por su extensión, por su tamaño y por su construcción comunitaria  es un dataset especialmente importante entre los que aparecen en la Web Semántica.\n\nWikidata ha desarrollado un modelo de datos complejo porque es un repositorio coeditado, generalista y que pretende recoger lo que otros afirman con registro de fuentes y de otros datos complementarios. Estas particularidades se aprecian enseguida por el uso de propiedades como P31 y P279 respectivamente para reemplazar las asignaciones a clases y la declaración subclases. Y también por el uso de enunciados indirectos y su duplicación como enunciados directos.\n\nEl uso básico de Wikidata, una vez familiarizados con las peculiaridades más repetidas, permite la recuperación de cientos de miles de datos sobre categorías diversas y muy interrelacionadas.","type":"content","url":"/select-wikidata-intro#sobre-wikidata","position":3},{"hierarchy":{"lvl1":"Consultas SELECT (Wikidata)","lvl2":"Consultas SELECT en Wikidata"},"type":"lvl2","url":"/select-wikidata-intro#consultas-select-en-wikidata","position":4},{"hierarchy":{"lvl1":"Consultas SELECT (Wikidata)","lvl2":"Consultas SELECT en Wikidata"},"content":"Tras las consultas presentadas en esta sección se puede continuar con las del propio \n\nTutorial sobre SPARQL de Wikidata. Este recursos y otros más avanzados se pueden encontrar en el \n\nPortal de Ayuda de Wikidata, más bien enfocado a facilitar el trabajo de los coeditores de datos.","type":"content","url":"/select-wikidata-intro#consultas-select-en-wikidata","position":5},{"hierarchy":{"lvl1":"Página sobre cada ítem"},"type":"lvl1","url":"/select-wikidata-pagina-item","position":0},{"hierarchy":{"lvl1":"Página sobre cada ítem"},"content":"Cada ítem en Wikidata es sujeto en diversas tripletas que lo describen.\n\nTodos estos enunciados se pueden recopilar, para un ítem dado, mediante una consulta SPARQL.\n\nWikidata mantiene para cada ítem adicionalmente un fichero específico que recopila todas esas tripletas.\n\nEn este caso último caso, basta demandar al servidor de Wikidata la descarga de ese fichero, sin necesidad de una consulta SPARQL interpuesta. De hecho, hay varias versiones de esta recopilación, en forma de ficheros separados, que muestran la misma información sobre el ítem expresada en formatos distintos: html, n-triples, turtle, json o rdf/xml.","type":"content","url":"/select-wikidata-pagina-item","position":1},{"hierarchy":{"lvl1":"Página sobre cada ítem","lvl2":"Consultas SPARQL sobre un ítem"},"type":"lvl2","url":"/select-wikidata-pagina-item#consultas-sparql-sobre-un-tem","position":2},{"hierarchy":{"lvl1":"Página sobre cada ítem","lvl2":"Consultas SPARQL sobre un ítem"},"content":"La siguiente consulta solicita cada tripleta (sujeto, propiedad, objeto) con sujeto wd:Q142. Como resultado se devuelven:\n\nTodas las ternas con ese ítem como sujeto : <Q142><p><o>\n\nY esto incluye el inicio de los enunciados indirectos, es decir, el enlace del sujeto con los nodos-statement de los enunciados indirectos, sin incluir su contenido: <Q142><p><_:stmtH>.\n\nConsulta: todas las tripletas con Q142 como sujetoSELECT ?s ?p ?o\nWHERE {\n  BIND (wd:Q142 AS ?s)\n  ?s ?p ?o .\n}    \n\nEjecución en Wikidata","type":"content","url":"/select-wikidata-pagina-item#consultas-sparql-sobre-un-tem","position":3},{"hierarchy":{"lvl1":"Página sobre cada ítem","lvl2":"Página html dedicada a un ítem"},"type":"lvl2","url":"/select-wikidata-pagina-item#p-gina-html-dedicada-a-un-tem","position":4},{"hierarchy":{"lvl1":"Página sobre cada ítem","lvl2":"Página html dedicada a un ítem"},"content":"Cualquier Q-ítem tiene un identificador en el mismo espacio de nombres (wd). En el caso de wd:Q142, el identificador es la URL: \n\nhttp://​www​.wikidata​.org​/entity​/Q142.\n\nTambién las propiedades, cuando se consideran como un ítem describible (como sujeto de enunciados que la describen) tienen su identificador en ese espacio de nombres. Por ejemplo, wd:P6, con identificador: \n\nhttp://​www​.wikidata​.org​/entity​/P6.\n\nPágina html informativa sobre un ítem\n\nLas página de un ítem muestra de manera informal las tripletas asociadas a ese ítem.\n\nSe asume que las tripletas mostradas informalmente tienen por sujeto el ítem que encabeza la página.\n\nCada una de estas páginas constan de cuatro secciones de enunciados sobre el ítem: (1) etiquetas, (2) enunciados, (3) identificadores externos y (4) enlaces internos en Wikimedia.\n\nCada una de estas secciones presentan sus filas en dos columnas, col1 y col2, respectivamente con la propiedad y el objeto asociados al item de la página: <item><valor_col1><valor_col2>.\n\nEstas páginas html sobre ítems son navegables entre sí:\n\nEn estas páginas, cuando se sitúa el cursor sobre un literal marcado como enlace, por ejemplo “instance of” o “France”, aparece el identificador abstracto de ese ítem o propiedad (P31 o Q142 en este ejemplo).\n\nPulsando cualquiera de esos enlaces se llega a la página html de ese ítem. Es decir, la navegación entre conceptos y propiedades relacionados en Wikidata se facilita sobre estas páginas html.","type":"content","url":"/select-wikidata-pagina-item#p-gina-html-dedicada-a-un-tem","position":5},{"hierarchy":{"lvl1":"Página sobre cada ítem","lvl3":"Sección de etiquetas","lvl2":"Página html dedicada a un ítem"},"type":"lvl3","url":"/select-wikidata-pagina-item#secci-n-de-etiquetas","position":6},{"hierarchy":{"lvl1":"Página sobre cada ítem","lvl3":"Sección de etiquetas","lvl2":"Página html dedicada a un ítem"},"content":"De cada entidad descrita, como  por ejemplo de la propiedad P6, se muestra una etiqueta principal, una descripción y quizá varias etiquetas alternativas, todo ello en cada uno de los idiomas en que esta información se haya registrado. La página html muestra una tabla resumen de estas etiquetas.\n\nEsto se puede apreciar en la página html de esta propiedad P6 considerada como un ítem. A esta página redirige Wikidata el enlace cuando se demanda al servidor el identificador de P6 (wd:P6, es decir, \n\nhttp://​www​.wikidata​.org​/entity​/P6) y la página explicativa a la que se llega en la redirección es \n\nhttps://​www​.wikidata​.org​/wiki​/Property:P6.\n\nComo medio complementario de información, la siguiente consulta muestra todas las etiquetas alternativas de P6 en español.\n\nConsulta: todas las etiquetas alternativas en español de la propiedad P6SELECT ?s ?sEtiqAlternativa\nWHERE {\n  BIND (wd:P6 AS ?s)\n  ?s skos:altLabel ?sEtiqAlternativa .\n  FILTER(LANG(?sEtiqAlternativa)=\"es\")     #1\n}\n\nEjecución en Wikidata\n\nSi se comenta la línea #1 (anteponiendo un símbolo #), al eliminar el filtrado por idioma, se obtendrían todas las etiquetas alternativas de la entidad en cualquiera de los idiomas en que existan.","type":"content","url":"/select-wikidata-pagina-item#secci-n-de-etiquetas","position":7},{"hierarchy":{"lvl1":"Página sobre cada ítem","lvl3":"Sección de enunciados","lvl2":"Página html dedicada a un ítem"},"type":"lvl3","url":"/select-wikidata-pagina-item#secci-n-de-enunciados","position":8},{"hierarchy":{"lvl1":"Página sobre cada ítem","lvl3":"Sección de enunciados","lvl2":"Página html dedicada a un ítem"},"content":"Esta sección aparece bajo la cabecera ‘Statements’ si el lenguaje de presentación de la página se mantiene en inglés. De nuevo aparece una presentación tabular en html como resumen de las ternas sobre la entidad.\n\nEsta tabla muestra la recopilación de enunciados indirectos tal y como se produce en el interfaz gráfico de edición de enunciados, que se describe en la página \n\nhttps://​www​.wikidata​.org​/wiki​/Help:Statements.\n\nEnunciados directos (exportados). Generalmente cada propiedad que aparece en la primera columna de esta tabla exporta todos sus valores principales en forma de enunciados directos (sin modificadores ni referencias añadidas). Es decir, usualmente para muchas tareas de información, basta hacer consultas SPARQL sobre estos enunciados directos.\n\nLa página html sobre un ítem no precisa qué valores se han exportado hacia enunciados directos. La siguiente consulta recupera todos los enunciados de un ítem concreto, en particular todos los enunciados <wd:Q142><wdt:Pxxx><o> registrados.\n\nConsulta: sobre Q142, todas sus tripletas <wd:Q142><wdt:Pxxx><o>\n\nEsta es no es una consulta adecuada a una primera aproximación. Se recomienda ejecutarla y leer con cuidado las explicaciones adjuntas.SELECT ?sujeto ?sujetoLabel ?propDirecta ?propLabel ?objeto ?objetoLabel\nWHERE {\n  BIND (wd:Q142 AS ?sujeto)\n  ?prop rdf:type wikibase:Property .                # 1\n  ?prop wikibase:directClaim ?propDirecta .         # 2\n  ?sujeto ?propDirecta ?objeto .                    # 3\n  SERVICE wikibase:label { bd:serviceParam wikibase:language \"es,en\". }\n}\nORDER BY ?propDirecta\n\nEjecución en Wikidata\n\nEstructura de la consulta\n\nLa consulta utiliza varios términos con prefijo wikibase:xxx cuyo uso conviene aclarar.\n\n(#1) Se pretende recorrer todas las propiedades aplicadas en Wikidata, para comprobar en cada una de ellas si se ha aplicado a wd:Q142. Todo ítem Pxxx que se declara como propiedad en Wikidata lo hace mediante una terna <wd:Pxxx><rdf:type><wikibase:Property>.\n\n(#2) Los item propiedad wd:Pxxx recuperados no se usan así al aplicarlos como propiedad en una terna sino como wdt:Pxxx. Cada propiedad tiene asociada una terna que relaciona su identificador como ítem describible y su uso en enunciados directos, del tipo: <wd:Pxxx><wikibase:directClaim><wdt:Pxxx>. Cada ejecución en #2 encuentra este respectivo cambio de prefijo.\n\nMediante al acceso al servicio wikibase:label se obtienen todas las etiquetas principales, etiquetas alternativas y descripciones de cada variable en WHERE. (En el caso de los ítem propiedad wd:Pxxx, las etiquetas están asociados a éstos y no a identificadores wdt:Pxxx que tan sólo marcan su uso sintáctico con ese cambio de prefijo. Por eso en SELECT se pide propLabel en vez de ?propDirectaLabel).\n\nEnunciados indirectos (todos). La relación de enunciados indirectos, con su información adicional, es la que se aprecia en la página html del ítem. La siguiente consulta devuelve estas asignaciones indirectas para el ítem wd:Q142, con un nodo-statement interpuesto. No se recoge la información añadida a estos nodos-statement.\n\nConsulta: sobre Q142, todos sus enunciado indirectosSELECT ?sujeto ?propHaciaStmt ?propLabel ?stmt ?propEnStmt ?valor\nWHERE {\n  BIND (wd:Q142 AS ?sujeto)                        # 0 Ejemplo aplicado a ?sujeto = wd:Q142\n  ?prop rdf:type wikibase:Property .               # 1 Encuentra cada wd:Pxxx propiedad en Wikidata\n  ?prop wikibase:claim ?propHaciaStmt .            # 2 De cada wd:Pxxx se obtiene su forma p:Pxxx\n  ?prop wikibase:statementProperty ?propEnStmt .   # 3 De cada wd:Pxxx se obtiene su forma ps:Pxxx\n  ?sujeto ?propHaciaStmt ?stmt .                   # 4 (sujeto, p:Pxxx, id_enunciado)\n  ?stmt ?propEnStmt ?valor .                       # 5 (id_enunciado, ps:Pxxx, valor_indirectamente_asignado)\n  SERVICE wikibase:label { bd:serviceParam wikibase:language \"es,en\". }\n}\nORDER BY ?propHaciaStmt\n\nEjecución en Wikidata","type":"content","url":"/select-wikidata-pagina-item#secci-n-de-enunciados","position":9},{"hierarchy":{"lvl1":"Página sobre cada ítem","lvl3":"Sección de identificadores externos","lvl2":"Página html dedicada a un ítem"},"type":"lvl3","url":"/select-wikidata-pagina-item#secci-n-de-identificadores-externos","position":10},{"hierarchy":{"lvl1":"Página sobre cada ítem","lvl3":"Sección de identificadores externos","lvl2":"Página html dedicada a un ítem"},"content":"Existen otras mucha bases de datos RDF públicas, usualmente más especializadas que Wikidata. Todas ellas forman la estructura de la Web de Datos Abiertos Enlazados y se mantienen de forma independiente aunque respetando unos estándares comunes. Estos estándares, como RDF, permiten a Wikidata incluir entre las ternas propias que describen a Miguel de Cervantes (Q5682) la siguiente:wd:Q5682 wdt:P950 https://datos.bne.es/resource/XX1718747que se puede leer como:\n\nel mismo concepto que el de mi ítem Q5682\n\ntiene como identificador en la Biblioteca Nacional de España (P950)\n\n...XX1718747\n\nEs decir, se reconoce aquí que ‘aquí y allí’ se está describiendo el mismo concepto y se informa sobre cuál es el identificador asignado ‘allí’. La propiedad P950 de Wikidata es la que se usa cada vez que se informa sobre el identificador de un concepto en la base de datos de la BNE.\n\nConsulta: todas las referencias a ítems en la BNE\n\nLa siguiente consulta recopila de forma transversal en Wikidata todos los ítems que se han relacionado con sus correspondientes en la BNE (porque todos ellos se han declarado mediante la propiedad P950: ‘tiene por identificador en la BNE’).SELECT ?idWikidata ?idWikidataEtiq ?idBNE ?urlBNE\nWHERE {\n  ?idWikidata wdt:P950 ?idBNE .\n  ?idWikidata   wdtn:P950 ?urlBNE .\n  ?idWikidata rdfs:label ?idWikidataEtiq. \n  FILTER(LANG(?idWikidataEtiq)=\"en\")\n}\n\nEjecución en Wikidata\n\nEn la página html de cada entidad, bajo esta sección ‘Identifiers’, se enumeran los identificadores en los diversos repositorios de la Web de Datos donde se está describiendo el mismo concepto.\n\nWikidata reserva para cada repositorio externo una propiedad que lo referencia, como ocurre con P950 para todas las referencias a identificadores en la BNE. Hay casi 8000 repositorios externos referenciados; es decir, este tipo de propiedades que remiten a otro repositorio suman casi ocho mil, dentro de las casi once mil propiedades de Wikidata.","type":"content","url":"/select-wikidata-pagina-item#secci-n-de-identificadores-externos","position":11},{"hierarchy":{"lvl1":"Página sobre cada ítem","lvl3":"Sección de enlaces a sitios internos","lvl2":"Página html dedicada a un ítem"},"type":"lvl3","url":"/select-wikidata-pagina-item#secci-n-de-enlaces-a-sitios-internos","position":12},{"hierarchy":{"lvl1":"Página sobre cada ítem","lvl3":"Sección de enlaces a sitios internos","lvl2":"Página html dedicada a un ítem"},"content":"Enlaces a artículos de wikidata en sitios internos diversos. La siguiente consulta retorna todas las entradas sobre Francia (Q142) en los diversos sitios de los proyectos de la Fundación WikiMedia.\n\nConsulta: sobre Q142, todos los enlaces dentro de WikiMediaSELECT ?artículo ?idioma ?sitio\nWHERE {\n  ?artículo schema:about wd:Q142 ;\n\t        schema:inLanguage ?idioma ;\n\t        schema:isPartOf ?sitio .\n}\nORDER BY ?idioma\n\nEjecución en Wikidata","type":"content","url":"/select-wikidata-pagina-item#secci-n-de-enlaces-a-sitios-internos","position":13},{"hierarchy":{"lvl1":"Página sobre cada ítem","lvl2":"Ficheros descargables sobre un item"},"type":"lvl2","url":"/select-wikidata-pagina-item#ficheros-descargables-sobre-un-item","position":14},{"hierarchy":{"lvl1":"Página sobre cada ítem","lvl2":"Ficheros descargables sobre un item"},"content":"La misma información facilitada en la página html de un ítem se puede obtener en diferentes formatos, finalizando esa dirección con la extensión del formato. Por ejemplo, las tripletas sobre Etanol (Q153) se pueden recuperar en los siguientes formatos:\n\nHTML: \n\nhttp://​www​.wikidata​.org​/entity​/Q153​.html, o bien sin extensión .html\n\nN-tripletas: \n\nhttp://​www​.wikidata​.org​/entity​/Q153​.nt\n\nTurtle: \n\nhttp://​www​.wikidata​.org​/entity​/Q153​.ttl\n\nJson: \n\nhttp://​www​.wikidata​.org​/entity​/Q153​.json\n\nRDF/XML: \n\nhttp://​www​.wikidata​.org​/entity​/Q153​.rdf\n\nLa versión Turtle es la más legible. Para refinar algunas consultas SPARQL conviene, a veces, echar un vistazo a esta presentación de un ítem.","type":"content","url":"/select-wikidata-pagina-item#ficheros-descargables-sobre-un-item","position":15},{"hierarchy":{"lvl1":"Propiedades en Wikidata"},"type":"lvl1","url":"/select-wikidata-propiedades","position":0},{"hierarchy":{"lvl1":"Propiedades en Wikidata"},"content":"","type":"content","url":"/select-wikidata-propiedades","position":1},{"hierarchy":{"lvl1":"Propiedades en Wikidata","lvl2":"Declaración de propiedades"},"type":"lvl2","url":"/select-wikidata-propiedades#declaraci-n-de-propiedades","position":2},{"hierarchy":{"lvl1":"Propiedades en Wikidata","lvl2":"Declaración de propiedades"},"content":"La aceptación de una nueva propiedad en Wikidata requiere de un proceso de estudio y acuerdo muy regulado. Por ello el número de propiedades (alrededor de doce mil) es significativamente menor que el de clases.flowchart LR\n    P(\"wd:Pxxx\") --> |\"rdf:type\\n (declaración)\"| CP[\"wikibase:Property\"]\n    P --> |\"wikibase:propertyType\\n (espera objeto de cierto tipo)\"| PO(\"(Tipo de objeto esperado)\")\n    P --> |\"wdt:P2302\\n (restricción de uso) \"| R(\"(Tipo de restricción)\")\n\nEn Wikidata, la incorporación de una nueva propiedad requiere las siguientes acciones:\n\nLa asignación de su identificador wd:Pxxx y su declaración (vía rdf:type) como perteneciente a la clase wikibase:Property.\n\nCuando relacione sujeto y objeto (como en <X><wdt:Pxxx><Y>), qué tipo dato se espera en Y.\n\nSi es el caso, qué restricciones de uso se asignan a esta propiedad wd:Pxxx","type":"content","url":"/select-wikidata-propiedades#declaraci-n-de-propiedades","position":3},{"hierarchy":{"lvl1":"Propiedades en Wikidata","lvl3":"Detección de propiedades en Wikidata","lvl2":"Declaración de propiedades"},"type":"lvl3","url":"/select-wikidata-propiedades#detecci-n-de-propiedades-en-wikidata","position":4},{"hierarchy":{"lvl1":"Propiedades en Wikidata","lvl3":"Detección de propiedades en Wikidata","lvl2":"Declaración de propiedades"},"content":"Como todas las propiedades se declaran pertenecientes a la clase wikibase:Property, la siguiente consulta retorna todas las propiedad en Wikidata junto a sus etiquetas textuales:SELECT ?prop ?propLabel ?propDescription ?propAltLabel\nWHERE {\n  ?prop rdf:type wikibase:Property .\n  SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\"}\n}\n\nEjecución en Wikidata","type":"content","url":"/select-wikidata-propiedades#detecci-n-de-propiedades-en-wikidata","position":5},{"hierarchy":{"lvl1":"Propiedades en Wikidata","lvl3":"Tipo de dato de una propiedad","lvl2":"Declaración de propiedades"},"type":"lvl3","url":"/select-wikidata-propiedades#tipo-de-dato-de-una-propiedad","position":6},{"hierarchy":{"lvl1":"Propiedades en Wikidata","lvl3":"Tipo de dato de una propiedad","lvl2":"Declaración de propiedades"},"content":"De una propiedad como tiene por padre (\n\nP22) se espera un uso `\n\nwdt:P22 que asocia un ítem X de Wikipedia con otro ítem Y de Wikipedia. La propiedad tiene por identificador en la BNE asocia un ítem X de Wikipedia con un identificador externo. Hay otras propiedades que asocian un ítem X con un texto (un literal), o con una imagen, entre otros tipos de dato posibles.\n\nLa propiedad ‘prop’ en <suj><prop><obj> asocia el sujeto con un objeto que puede pertenecer a uno de pocos tipos de dato. La siguiente consulta devuelve los distintos tipos de dato y el número de propiedades que esperan ese tipo en sus objetos.SELECT ?prop_tipo (COUNT(?prop) AS ?numProps)\nWHERE {\n  ?prop rdf:type wikibase:Property .\n  ?prop wikibase:propertyType ?prop_tipo\n}\nGROUP BY ?prop_tipo\nORDER BY DESC(?numProps)\n\n\nEjecución en Wikidata\n\nMás detalladamente, se puede ejecutar un consulta que devuelve todas las propiedades con su tipo de dato correspondiente.SELECT ?prop ?propLabel ?prop_tipo\nWHERE {\n  ?prop rdf:type wikibase:Property .\n  ?prop wikibase:propertyType ?prop_tipo\n  SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\"}\n}\nORDER BY ?prop_tipo\n\nEjecución en Wikidata","type":"content","url":"/select-wikidata-propiedades#tipo-de-dato-de-una-propiedad","position":7},{"hierarchy":{"lvl1":"Propiedades en Wikidata","lvl3":"Restricciones de uso de una propiedad","lvl2":"Declaración de propiedades"},"type":"lvl3","url":"/select-wikidata-propiedades#restricciones-de-uso-de-una-propiedad","position":8},{"hierarchy":{"lvl1":"Propiedades en Wikidata","lvl3":"Restricciones de uso de una propiedad","lvl2":"Declaración de propiedades"},"content":"La asignación de restricciones de uso a una propiedad es un tema detalladamente técnico que no concierne a un usuario de Wikidata. Las restricciones son tan sólo indicaciones formalizadas que ayudan a los editores de datos en Wikidata a detectar errores de edición. Por ejemplo, la propiedad P6 (tiene por jefe de este órgano de gobierno a) espera que el objeto de tripleta sea una persona.\n\nSe puede obviar este apartado en una primera lectura. En el porta de ayuda de Wikidata hay una página dedicada a la \n\nasignación de restricciones a una propiedad. La siguiente consulta muestra, para cada propiedad, qué restricciones formales tiene declaradas:SELECT ?prop ?propLabel ?propDescription ?restricción ?restricciónLabel ?restricciónDescription\nWHERE {\n  ?prop rdf:type wikibase:Property .\n  ?prop wdt:P2302 ?restricción .\n  SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nORDER BY ?prop\n\nEjecución en Wikidata","type":"content","url":"/select-wikidata-propiedades#restricciones-de-uso-de-una-propiedad","position":9},{"hierarchy":{"lvl1":"Propiedades en Wikidata","lvl2":"Clasificación por temática de uso"},"type":"lvl2","url":"/select-wikidata-propiedades#clasificaci-n-por-tem-tica-de-uso","position":10},{"hierarchy":{"lvl1":"Propiedades en Wikidata","lvl2":"Clasificación por temática de uso"},"content":"De cada propiedad se facilita al menos un ejemplo de uso. Las propiedades pueden agruparse entre sí conforme al área temática de uso para las que fueron propuestas.flowchart LR\n    P(\"wd:Pxxx\") --> |\"wdt:P1855\\n (ejemplo de uso)\"| SE(\"(ejemp_sujeto)\")\n    SE --> |\"wdt:Pxxx\"| OE(\"(ejemp_objeto)\")\n    P --> |\"wdt:P31\\n (instancia de)\"| PT(\"(Clase temática\\n de propiedades)\")","type":"content","url":"/select-wikidata-propiedades#clasificaci-n-por-tem-tica-de-uso","position":11},{"hierarchy":{"lvl1":"Propiedades en Wikidata","lvl3":"Ejemplo de uso de cada propiedad","lvl2":"Clasificación por temática de uso"},"type":"lvl3","url":"/select-wikidata-propiedades#ejemplo-de-uso-de-cada-propiedad","position":12},{"hierarchy":{"lvl1":"Propiedades en Wikidata","lvl3":"Ejemplo de uso de cada propiedad","lvl2":"Clasificación por temática de uso"},"content":"De cada propiedad creada se facilita, al menos, un ejemplo de uso. La relación entre propiedad y ejemplo se expresa mediante P1855, que enlaza la propiedad con el sujeto del ejemplo.SELECT ?sujetoEj ?sujetoEjLabel ?propWdt ?propLabel ?objetoEj ?objetoEjLabel\nWHERE {\n  ?prop wikibase:directClaim ?propWdt .\n  ?prop wdt:P1855 ?sujetoEj .\n  ?sujetoEj ?propWdt ?objetoEj .\n  SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\n\nEjecución en Wikidata","type":"content","url":"/select-wikidata-propiedades#ejemplo-de-uso-de-cada-propiedad","position":13},{"hierarchy":{"lvl1":"Propiedades en Wikidata","lvl3":"Clases temáticas de propiedades","lvl2":"Clasificación por temática de uso"},"type":"lvl3","url":"/select-wikidata-propiedades#clases-tem-ticas-de-propiedades","position":14},{"hierarchy":{"lvl1":"Propiedades en Wikidata","lvl3":"Clases temáticas de propiedades","lvl2":"Clasificación por temática de uso"},"content":"Las propiedades se asignan a clases, que las agrupan. Algunas de estas clases pueden ser subclases de otras.SELECT ?prop ?propLabel ?propClase ?propClaseLabel ?propSuperClase ?propSuperClaseDescription\nWHERE {\n  ?prop rdf:type wikibase:Property .\n  ?prop wdt:P31 ?propClase .\n  OPTIONAL{?propClase wdt:P279 ?propSuperClase .}\n  SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nORDER BY ?propClase\n\nEjecución en Wikidata","type":"content","url":"/select-wikidata-propiedades#clases-tem-ticas-de-propiedades","position":15},{"hierarchy":{"lvl1":"Propiedades en Wikidata","lvl3":"Propiedad requerida por una clase de items","lvl2":"Clasificación por temática de uso"},"type":"lvl3","url":"/select-wikidata-propiedades#propiedad-requerida-por-una-clase-de-items","position":16},{"hierarchy":{"lvl1":"Propiedades en Wikidata","lvl3":"Propiedad requerida por una clase de items","lvl2":"Clasificación por temática de uso"},"content":"flowchart LR\n    CZ[\"(Clase ZZ)\"] --> |\"wdt:P1963\\n (propiedad requerida en clase ZZ)\"| P(\"wd:Pxxx\")\n\nAlgunas clases de ítems requieren el uso de ciertas propiedades sobre ellos para completar la información básica que se espera de ese ítem.SELECT ?claseÍtems ?claseÍtemsLabel ?propRequerida ?propRequeridaLabel\nWHERE {\n  ?claseÍtems wdt:P1963 ?propRequerida .\n  SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\n\nEjecución en Wikidata","type":"content","url":"/select-wikidata-propiedades#propiedad-requerida-por-una-clase-de-items","position":17},{"hierarchy":{"lvl1":"Propiedades en Wikidata","lvl2":"Relación entre propiedades"},"type":"lvl2","url":"/select-wikidata-propiedades#relaci-n-entre-propiedades","position":18},{"hierarchy":{"lvl1":"Propiedades en Wikidata","lvl2":"Relación entre propiedades"},"content":"flowchart LR\n    P(\"wd:Pxxx\") --> |\"wdt:P1647\\n (subpropiedad de)\"| PB(\"wd:Pzzz\")\n    P --> |\"wdt:P1659\\n (propiedad relativa)\"| PR(\"wd:Pkkk\")","type":"content","url":"/select-wikidata-propiedades#relaci-n-entre-propiedades","position":19},{"hierarchy":{"lvl1":"Propiedades en Wikidata","lvl3":"Subpropiedades","lvl2":"Relación entre propiedades"},"type":"lvl3","url":"/select-wikidata-propiedades#subpropiedades","position":20},{"hierarchy":{"lvl1":"Propiedades en Wikidata","lvl3":"Subpropiedades","lvl2":"Relación entre propiedades"},"content":"La siguiente consulta devuelve todas las propiedades en Wikidata. Opcionalmente, cuando sea el caso de que una propiedad (en ?prop) es subpropiedad de otra (en ?prop_super), indica esta inclusión.SELECT ?prop ?propLabel ?propDescription ?prop_super ?prop_superLabel\nWHERE {\n  ?prop rdf:type wikibase:Property .\n  OPTIONAL {?prop wdt:P1647 ?prop_super .}\n  SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nORDER BY ?prop\n\nEjecución en Wikidata","type":"content","url":"/select-wikidata-propiedades#subpropiedades","position":21},{"hierarchy":{"lvl1":"Propiedades en Wikidata","lvl3":"Propiedades relativas","lvl2":"Relación entre propiedades"},"type":"lvl3","url":"/select-wikidata-propiedades#propiedades-relativas","position":22},{"hierarchy":{"lvl1":"Propiedades en Wikidata","lvl3":"Propiedades relativas","lvl2":"Relación entre propiedades"},"content":"De cada propiedad se puede indicar que hay otras propiedades relacionadas, por una razón u otra. La siguiente consulta muestra esta relación entre propiedades:SELECT ?prop ?propLabel ?propDescription ?prop_relat ?prop_relatLabel\nWHERE {\n  ?prop rdf:type wikibase:Property .\n  OPTIONAL {?prop wdt:P1659 ?prop_relat .}\n  SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nORDER BY ?prop\n\nEjecución en Wikidata","type":"content","url":"/select-wikidata-propiedades#propiedades-relativas","position":23},{"hierarchy":{"lvl1":"Consultas SELECT (NobelPrize)"},"type":"lvl1","url":"/sparql-intro","position":0},{"hierarchy":{"lvl1":"Consultas SELECT (NobelPrize)"},"content":"SPARQL 1.1 es un conjunto de estándares con tres funcionalidades  complementarias:\n\nEs un protocolo de comunicación con servidores de datos RDF\n\nEs un lenguaje de consulta de esos datasets RDF, que devuelve datos como respuesta\n\nEs un lenguaje de administración de esos datos, con opciones de borrado, inserción y actualización\n\nSobre esta sección\n\nSe comienza el estudio de SPARQL como lenguaje de consulta. En esta modalidad se pueden remitir dos tipos de consultas a un dataset: de tipo SELECT (que devuelve relaciones entre N entidades en forma de tabla de N columnas) y de tipo CONSTRUCT (que devuelve grafos, conjuntos de tripletas).\n\nEsta sección se dedica al estudio introductorio de las consultas SELECT\n\nComo dataset de consulta se ha escogido el que mantiene la Fundación Nobel\n\nLa ejecución de estas consultas se puede realizar sobre el interfaz de consulta facilitado por la Fundación Nobel\n\nEl primer apartado, Consultas exploratorias, facilita las consultas generales que se pueden realizar a un dataset RDF del que no se conoce todavía su estructura (sus clases, sus propiedades, etc). Se presenta la estructura general de una consulta SELECT y ejemplos con instrucciones para ejecutarlos sobre el interfaz de consulta oficial de la Fundación Nobel.\n\nEl segundo apartado, El vocabulario NobelPrize, describe la estructura conceptual que alberga los datos de ese datasets: los nombres de sus clases y propiedades. Y facilita ejemplos de consulta que ya utilizan esa información específica en sus patrones de búsqueda.\n\nLos siguientes apartados de esta sección resumen, con ejemplos ejecutables, los patrones de búsqueda básicos en consultas SPARQL de tipo SELECT.","type":"content","url":"/sparql-intro","position":1}]}